#X-Generator: crowdin.com
edit-contract.pageTitle=Editar el contrato {0}
edit-contract.h1=Editar el contrato {0}
edit-contract.contractLabel=<span class\="mandatory">*</span> Etiqueta
edit-contract.contractUrl=URL
edit-contract.contractBeginDate=<span class\="mandatory">*</span> Fecha de inicio
edit-contract.contractBeginDateRule=formato dd/MM/aaaa
edit-contract.contractEndDate=<span class\="mandatory">*</span> Fecha de finalizaci\u00f3n
edit-contract.contractEndDateRule=formato dd/MM/aaaa
edit-contract.referentials=Referenciales
edit-contract.functionalities=Tipos de evaluaci\u00f3n
edit-contract.options=Opciones
edit-contract.ACT_LIMITATION=N\u00famero de evaluaciones autorizadas
edit-contract.MAX_DURATION=Duraci\u00f3n m\u00e1xima de rastreo durante las evaluaciones de dominio
edit-contract.NB_OF_AUDIT_TO_DISPLAY=N\u00famero de evaluaciones a mostrar en la p\u00e1gina del contrato
edit-contract.EXCLUSION_REGEXP=Expresi\u00f3n regular utilizada para excluir p\u00e1ginas durante las evaluaciones de dominio
edit-contract.DEPTH=Profundidad m\u00e1xima de rastreo durante las evaluaciones de dominio
edit-contract.MAX_DOCUMENTS=N\u00famero m\u00e1ximo de documentos rastreados en profundidad de rastreo durante evaluaciones de dominios
edit-contract.saveChanges=Guardar cambios
edit-contract.emptyLabel=Por favor, introduzca una etiqueta.
edit-contract.emptyBeginDate=Introduce una fecha de inicio
edit-contract.emptyEndDate=Introduce una fecha de finalizaci\u00f3n
edit-contract.emptyUserList=Por favor seleccione al menos un usuario
edit-contract.emptyRefList=Por favor seleccione al menos un referencial
edit-contract.endDateAnteriorToBeginDate=Por favor, elije una fecha de finalizaci\u00f3n que no sea anterior a la fecha de inicio
edit-contract.typeAuditCombinationIsNotAllowed=Por favor, cambia la combinaci\u00f3n en el tipo de evaluaci\u00f3n
edit-contract.PAGES=P\u00e1gina
edit-contract.DOMAIN=Sitio
edit-contract.MANUAL=Manual
edit-contract.UPLOAD=Archivos sin conexi\u00f3n
edit-contract.absenceManualVAlues=Faltan valores en los resultados \: {0}
edit-contract.absenceManualVAluesOverTen=Faltan valores en los resultados (m\u00e1s de 10) \: {0}
edit-contract.SCENARIO=Escenario
edit-contract.crawlOptionsInfo=Estas opciones s\u00f3lo se utilizan cuando se elige el tipo de evaluaci\u00f3n del sitio.
general-options=Opciones
crawl-options=Opciones de rastreo
nb-max-audits-per-contract-error=Por favor, introduzca un n\u00famero v\u00e1lido de evaluaciones por contrato.
nb-max-audits-per-contract=N\u00famero m\u00e1ximo de evaluaciones autorizadas para este contrato.
nb-max-audits-per-contract-rule=Dejar en blanco para indicar infinito. Vale para todos los tipos de evaluaci\u00f3n.
nb-max-acts-per-contract=N\u00famero de evaluaciones a mostrar en el historial de la p\u00e1gina del contrato
nb-max-acts-per-contract-error=Por favor, introduce un n\u00famero v\u00e1lido de evaluaciones a mostrar 
nb-max-acts-per-contract-rule=Vac\u00edo significa infinito. Vale para todos los tipos de evaluaci\u00f3n.
nb-max-pages-audits-per-contract=N\u00famero m\u00e1ximo de evaluaciones autorizadas para este contrato.
nb-max-pages-audits-per-contract-rule=Dejar en blanco para indicar infinito. S\u00f3lo vale para evaluaciones por p\u00e1gina.
nb-max-pages-audits-per-contract-error=Por favor, introduzca un n\u00famero v\u00e1lido de evaluaciones por contrato.
nb-max-domain-audits-per-contract=N\u00famero m\u00e1ximo de evaluaciones autorizadas para este contrato.
nb-max-domain-audits-per-contract-rule=Dejar en blanco para indicar infinito. S\u00f3lo vale para evaluaciones por dominio.
nb-max-domain-audits-per-contract-error=Por favor, introduzca un n\u00famero v\u00e1lido de evaluaciones de dominio por contrato.
nb-max-upload-audits-per-contract=N\u00famero m\u00e1ximo de evaluaciones subidas autorizadas para este contrato.
nb-max-upload-audits-per-contract-rule=Dejar en blanco para indicar infinito. S\u00f3lo vale para evaluaciones subidas.
nb-max-upload-audits-per-contract-error=Por favor, introduzca un n\u00famero v\u00e1lido de evaluaciones subidas por contrato.
nb-max-scenario-audits-per-contract=N\u00famero m\u00e1ximo de escenarios de evaluaci\u00f3n autorizados para este contrato.
nb-max-scenario-audits-per-contract-rule=Dejar en blanco para indicar infinito. S\u00f3lo vale para escenarios de evaluaci\u00f3n.
nb-max-scenario-audits-per-contract-error=Por favor, introduzca un n\u00famero v\u00e1lido de escenarios  de evaluaci\u00f3n por contrato.
