Aw21-01011=Chaque image (balise img) a-t-elle un attribut alt?
Aw21-01011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-1-1-1
Aw21-01012=Chaque zone (balise area) d&#39;une image r&eacute;active a-t-elle un attribut alt?
Aw21-01012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-1-1-2
Aw21-01013=Chaque bouton de formulaire (balise input avec l&#39;attribut type="image") a-t-il un attribut alt?
Aw21-01013-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-1-1-3
Aw21-01021=Pour chaque image de d&eacute;coration (balise img) ayant un attribut alt, le contenu de cet attribut est-il vide (alt="")?
Aw21-01021-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-1-2-1
Aw21-01031=Pour chaque image porteuse d&#39;information (balise img) ayant un attribut alt, le contenu de cet attribut est-il pertinent (hors cas particuliers)?
Aw21-01031-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-1-3-1
Aw21-02011=Chaque cadre (balise frame) a-t-il un attribut title?
Aw21-02011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-2-1-1
Aw21-02012=Chaque cadre en ligne (balise iframe) a-t-il un attribut title?
Aw21-02012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-2-1-2
Aw21-05011=Chaque tableau de donn&eacute;es (balise table) a-t-il un attribut summary?
Aw21-05011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-5-1-1
Aw21-05041=Chaque tableau de donn&eacute;es (balise table) a-t-il une balise caption?
Aw21-05041-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-5-4-1
Aw21-06011=Pour chaque lien texte le contexte du lien permet-il d&#39;en comprendre la fonction et la destination (hors cas particuliers)?
Aw21-06011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-1-1
Aw21-06012=Pour chaque lien image (contenu de l&#39;attribut alt ou texte entre &lt;object&gt; et &lt;/object&gt;) le contexte du lien permet-il d&#39;en comprendre la fonction et la destination (hors cas particuliers)?
Aw21-06012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-1-2
Aw21-06013=Pour chaque lien de type zone cliquable (contenu de l&#39;attribut alt d&#39;une balise area) le contexte du lien permet-il d&#39;en comprendre la fonction et la destination (hors cas particuliers)?
Aw21-06013-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-1-3
Aw21-06021=Pour chaque lien texte ayant un titre de lien (attribut title), le contenu de cet attribut est-il pertinent?
Aw21-06021-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-2-1
Aw21-06022=Pour chaque lien image ayant un titre de lien (attribut title), le contenu de cet attribut est-il pertinent?
Aw21-06022-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-2-2
Aw21-06023=Pour chaque zone cliquable (balise area) ayant un titre de lien (attribut title), le contenu de cet attribut est-il pertinent?
Aw21-06023-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-2-3
Aw21-06024=Pour chaque lien composite ayant un titre de lien (attribut title), le contenu de cet attribut est-il pertinent?
Aw21-06024-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-2-4
Aw21-06031=Chaque intitul&eacute; de lien texte est-il explicite hors contexte (hors cas particulier)?
Aw21-06031-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-3-1
Aw21-06032=Chaque intitul&eacute; de lien image (contenu de l&#39;attribut alt ou contenu entre &lt;object&gt;&lt;/object&gt;) est-il explicite hors contexte (hors cas particulier)?
Aw21-06032-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-3-2
Aw21-06033=Chaque intitul&eacute; de lien de type zone cliquable (contenu de l&#39;attribut alt d&#39;une balise area) est-il explicite hors contexte (hors cas particulier)?
Aw21-06033-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-3-3
Aw21-06041=Chaque lien identique de type texte a-t-il les m&ecirc;mes fonction et destination?
Aw21-06041-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-4-1
Aw21-06042=Chaque lien identique de type image a-t-il les m&ecirc;mes fonction et destination?
Aw21-06042-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-4-2
Aw21-06043=Chaque lien identique de type zone cliquable a-t-il les m&ecirc;mes fonction et destination?
Aw21-06043-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-4-3
Aw21-06061=Dans chaque page Web, chaque lien (balise a), \u00e0 l&#39;exception des ancres nomm&eacute;es, a-t-il un intitul&eacute; entre &lt;a&gt; et &lt;/a&gt;?
Aw21-06061-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-6-6-1
Aw21-07051=Chaque script qui initie un changement de contexte v&eacute;rifie-t-il une de ces conditions?<ul><li> L&#39;utilisateur est averti par un texte de l&#39;action du script et du type de changement avant son d&eacute;clenchement</li><li> Le changement de contexte est initi&eacute; par un bouton (input de type submit ou button) explicite</li><li> Le changement de contexte est initi&eacute; par un lien explicite</li></ul>
Aw21-07051-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-7-5-1
Aw21-08011=Pour chaque page Web, le type de document (balise doctype) est-il pr&eacute;sent?
Aw21-08011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-1-1
Aw21-08012=Pour chaque page Web, le type de document (balise doctype) est-il valide?
Aw21-08012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-1-2
Aw21-08031=Pour chaque page Web, l&#39;indication de langue par d&eacute;faut v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;indication de la langue de la page (attribut lang et/ou xml:lang) est donn&eacute;e pour l&#39;&eacute;l&eacute;ment Html</li><li> L&#39;indication de la langue de la page (attribut lang et/ou xml:lang) est donn&eacute;e sur chaque &eacute;l&eacute;ment de texte ou sur l&#39;un des &eacute;l&eacute;ments parents</li></ul>
Aw21-08031-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-3-1
Aw21-08041=Pour chaque page Web ayant une langue par d&eacute;faut, le code de langue v&eacute;rifie-t-il ces conditions?<ul><li> Le code de langue est valide</li><li> Le code de langue est pertinent</li></ul>
Aw21-08041-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-4-1
Aw21-08051=Chaque page Web a-t-elle un titre de page (balise title)?
Aw21-08051-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-5-1
Aw21-08061=Pour chaque page Web ayant un titre de page (balise title), le contenu de cette balise est-il pertinent?
Aw21-08061-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-8-6-1
Aw21-09011=Dans chaque page Web, y a-t-il un titre de niveau 1 (balise h1)?
Aw21-09011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-9-1-1
Aw21-09012=Dans chaque page Web, la hi&eacute;rarchie entre les titres (balises h) est-elle pertinente?
Aw21-09012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-9-1-2
Aw21-09021=Dans chaque page Web, les informations regroup&eacute;es sous forme de listes non ordonn&eacute;es utilisent-elles les balises ul et li?
Aw21-09021-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-9-2-1
Aw21-09022=Dans chaque page Web, les informations regroup&eacute;es sous forme de listes ordonn&eacute;es utilisent-elles les balises ol et li?
Aw21-09022-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-9-2-2
Aw21-10011=Dans chaque page Web, les balises servant \u00e0 la pr&eacute;sentation de l&#39;information ne doivent pas &ecirc;tre pr&eacute;sentes dans le code source des pages. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-10-1-1
Aw21-10012=Dans chaque page Web, les attributs servant \u00e0 la pr&eacute;sentation de l&#39;information ne doivent pas &ecirc;tre pr&eacute;sents dans le code source des pages. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-10-1-2
Aw21-10041=Dans les feuilles de styles du site Web, les unit&eacute;s non relatives (pt, pc, mm, cm, in) ne doivent pas &ecirc;tre utilis&eacute;es pour les types de m&eacute;dia screen, tv, handheld, projection. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10041-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-10-4-1
Aw21-11011=Chaque champ de formulaire (balise input de type text, password, checkbox, radio, file ou balises textarea et select), v&eacute;rifie-t-il une de ces conditions?<ul><li> Le champ de formulaire poss&egrave;de un attribut title</li><li> Une &eacute;tiquette (balise label) est associ&eacute;e au champ de formulaire</li></ul>
Aw21-11011-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-1-1
Aw21-11012=Chaque champ de formulaire (balise input de type text, password, checkbox, radio, file ou balises textarea et select), associ&eacute; \u00e0 une &eacute;tiquette (balise label), v&eacute;rifie-t-il ces conditions?<ul><li> Le champ de formulaire poss&egrave;de un attribut id</li><li> La valeur de l&#39;attribut id est unique</li></ul>
Aw21-11012-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-1-2
Aw21-11013=Chaque &eacute;tiquette (balise label) associ&eacute;e \u00e0 un champ de formulaire (balise input de type text, password, checkbox, radio, file ou balises textarea et select) v&eacute;rifie-t-elle ces conditions?<ul><li> La balise label poss&egrave;de un attribut for</li><li> La valeur de l&#39;attribut for est &eacute;gale \u00e0 la valeur de l&#39;attribut id du champ de formulaire associ&eacute;</li></ul>
Aw21-11013-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-1-3
Aw21-11061=Chaque regroupement de champs de formulaire (balise fieldset) est-il suivi dans le code source par une l&eacute;gende (balise legend)?
Aw21-11061-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-6-1
Aw21-11082=Dans chaque liste de choix (balise select), chaque regroupement d&#39;items de liste (balise optgroup) poss&egrave;de-t-il un attribut label?
Aw21-11082-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-8-2
Aw21-11091=Dans chaque formulaire, l&#39;intitul&eacute; de chaque bouton v&eacute;rifie-t-il une de ces conditions?<ul><li> Le contenu de l&#39;attribut value des boutons de formulaire de type submit, reset ou button est pertinent</li><li> Le contenu de la balise &lt;button&gt; est pertinent</li><li> Le contenu de l&#39;attribut title est pertinent</li></ul>
Aw21-11091-url=http://www.braillenet.org/accessibilite/referentiel-aw21/liste-deploye.php#test-11-9-1
Aw21-03011=Pour chaque mot ou ensemble de mots dont la mise en couleur est porteuse d&#39;information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03011-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-1
Aw21-03012=Pour chaque indication de couleur donn&eacute;e par un texte, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03012-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-2
Aw21-03013=Pour chaque image pr&eacute;sente dans le code source v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-3
Aw21-03014=Pour chaque propri&eacute;t&eacute; CSS d&eacute;terminant une couleur et v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-4
Aw21-03015=Pour chaque m&eacute;dia temporel v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03015-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-5
Aw21-03016=Pour chaque m&eacute;dia non temporel v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-03016-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-1-6
Aw21-03021=Pour chaque information v&eacute;hicul&eacute;e par la couleur d&#39;un mot ou ensemble de mots, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-1
Aw21-03022=Pour chaque information v&eacute;hicul&eacute;e par la couleur et indiqu&eacute;e par un mot ou un ensemble de mots, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-2
Aw21-03023=Pour chaque image v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-3
Aw21-03024=Pour chaque propri&eacute;t&eacute; de fond d\u2019&eacute;l&eacute;ment CSS v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03024-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-4
Aw21-03025=Pour chaque m&eacute;dia temporel v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03025-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-5
Aw21-03026=Pour chaque m&eacute;dia non temporel v&eacute;hiculant une information, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la couleur. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-03026-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-2-6
Aw21-03031=Dans chaque page Web, <strong>jusqu&#39;\u00e0 150%</strong> de la taille de police par d&eacute;faut (ou 1.5em), le texte et le texte en image sans effet de graisse v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re-plan est de 4,5:1, au moins</li><li> un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 4,5:1, au moins</li></ul>
Aw21-03031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-3-1
Aw21-03032=Dans chaque page Web, <strong>jusqu&#39;\u00e0 120%</strong> de la taille de police par d&eacute;faut (ou 1.2em), le texte et le texte en image en gras v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re-plan est de 4,5:1, au moins</li><li>un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 4,5:1, au moins</li></ul>
Aw21-03032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-3-2
Aw21-03033=Dans chaque page Web, <strong>\u00e0 partir de 150%</strong> de la taille de police par d&eacute;faut (ou 1.5em), le texte et le texte en image sans effet de graisse v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re plan est de 3:1, au moins</li><li>un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 3:1, au moins</li></ul>
Aw21-03033-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-3-3
Aw21-03034=Dans chaque page Web, <strong>\u00e0 partir de 120%</strong> de la taille de police par d&eacute;faut (ou 1.2em), le texte et le texte en image en gras v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re plan est de 3:1, au moins</li><li> un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 3:1, au moins</li></ul>
Aw21-03034-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-3-4
Aw21-03041=Dans chaque page Web, <strong>jusqu&#39;\u00e0 150%</strong> de la taille de police par d&eacute;faut (ou 1.5em), le texte et le texte en image sans effet de graisse v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re-plan est de 7:1, au moins</li><li> un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 7:1, au moins</li></ul>
Aw21-03041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-4-1
Aw21-03042=Dans chaque page Web, <strong>jusqu&#39;\u00e0 120%</strong> de la taille de police par d&eacute;faut (ou 1.2em), le texte et le texte en image en gras v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re-plan est de 7:1, au moins</li><li>un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 7:1, au moins</li></ul>
Aw21-03042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-4-2
Aw21-03043=Dans chaque page Web, <strong>\u00e0 partir de 150%</strong> de la taille de police par d&eacute;faut (ou 1.5em), le texte et le texte en image sans effet de graisse v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re plan est de 4,5:1, au moins</li><li>un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 4,5:1, au moins</li></ul>
Aw21-03043-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-4-3
Aw21-03044=Dans chaque page Web, <strong>\u00e0 partir de 120%</strong> de la taille de police par d&eacute;faut (ou 1.2em), le texte et le texte en image en gras v&eacute;rifient-ils une de ces conditions (hors cas particuliers)?<ul><li> le rapport de contraste entre le texte et son arri&egrave;re plan est de 4,5:1, au moins</li><li> un m&eacute;canisme permet \u00e0 l&#39;utilisateur d&#39;afficher le texte avec un rapport de contraste de 4,5:1, au moins</li></ul>
Aw21-03044-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-3-4-4
Aw21-04011=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement audio , v&eacute;rifie-t-il, si n&eacute;cessaire, l&#39;une de ces conditions (hors cas particuliers)?<ul><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li></ul>
Aw21-04011-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-1-1
Aw21-04012=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement vid&eacute;o v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li><li> Il existe une audio-description synchronis&eacute;e </li><li> Il existe une version alternative avec une audio-description synchronis&eacute;e accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une version alternative audio seulement accessible via un lien adjacent (une url ou une ancre)</li></ul>
Aw21-04012-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-1-2
Aw21-04013=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li><li> Il existe une audio-description synchronis&eacute;e</li><li> Il existe une version alternative avec une audio-description synchronis&eacute;e accessible via un lien adjacent (une url ou une ancre</li></ul>
Aw21-04013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-1-3
Aw21-04014=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute;, ins&eacute;r&eacute; via &lt;object&gt; ou &lt;embed&gt; et qui n&eacute;cessite une transcription textuelle v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;object&gt; et &lt;/object&gt;</li><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;noembed&gt; et &lt;/noembed&gt;</li></ul>
Aw21-04014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-1-4
Aw21-04021=Pour chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement audio, ayant une transcription textuelle, celle-ci est-elle pertinente (hors cas particuliers)?
Aw21-04021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-2-1
Aw21-04022=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement vid&eacute;o v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>La transcription textuelle est pertinente</li><li>L&#39;audio-description synchronis&eacute;e est pertinente</li><li>L&#39;audio-description synchronis&eacute;e de la version alternative est pertinente</li></ul>
Aw21-04022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-2-2
Aw21-04023=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>La transcription textuelle est pertinente</li><li>L&#39;audio-description synchronis&eacute;e est pertinente</li><li>L&#39;audio-description synchronis&eacute;e de la version alternative est pertinente</li></ul>
Aw21-04023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-2-3
Aw21-04031=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; v&eacute;rifie-t-il l&#39;une de ces conditions (hors cas particuliers)?<ul><li>Le m&eacute;dia temporel synchronis&eacute; poss&egrave;de des sous-titres synchronis&eacute;s</li><li>Il existe une version alternative poss&eacute;dant des sous-titres synchronis&eacute;s accessible via un lien adjacent (une url ou une ancre)</li></ul>
Aw21-04031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-3-1
Aw21-04041=Pour chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; ayant des sous-titres synchronis&eacute;s, ces sous-titres sont-ils pertinents?
Aw21-04041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-4-1
Aw21-04051=Chaque m&eacute;dia temporel seulement audio en direct v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Il existe des sous-titres synchronis&eacute;s</li><li> Il existe une version ayant des sous-titres synchronis&eacute;s accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li></ul>
Aw21-04051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-5-1
Aw21-04052=Chaque m&eacute;dia temporel synchronis&eacute; en direct v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Il existe des sous-titres synchronis&eacute;s</li><li> Il existe une version ayant des sous-titres synchronis&eacute;s accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li></ul>
Aw21-04052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-5-2
Aw21-04053=Chaque m&eacute;dia temporel synchronis&eacute; ou seulement audio, ins&eacute;r&eacute; via &lt;object&gt; ou &lt;embed&gt; et qui n&eacute;cessite une transcription textuelle v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;object&gt; et &lt;/object&gt;</li><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;noembed&gt; et &lt;/noembed&gt;</li></ul>
Aw21-04053-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-5-3
Aw21-04061=Chaque m&eacute;dia temporel seulement audio en direct v&eacute;rifie-t-il une de ces conditions?<ul><li> Les sous-titres synchronis&eacute;s sont pertinents</li><li> Les sous-titres synchronis&eacute;s de la version alternative sont pertinents</li><li> La transcription textuelle est pertinente</li></ul>
Aw21-04061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-6-1
Aw21-04062=Chaque m&eacute;dia temporel synchronis&eacute; en direct v&eacute;rifie-t-il une de ces conditions?<ul><li> Les sous-titres synchronis&eacute;s sont pertinents</li><li> Les sous-titres synchronis&eacute;s de la version alternative sont pertinents</li><li> La transcription textuelle est pertinente</li></ul>
Aw21-04062-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-6-2
Aw21-04071=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; v&eacute;rifie-t-il une de ces conditions?<ul><li>Il existe une piste pour l&#39;audio-description synchronis&eacute;e</li><li>Il existe une version alternative avec une audio-description synchronis&eacute;e</li></ul>
Aw21-04071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-7-1
Aw21-04081=Pour chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement vid&eacute;o ayant une audio-description synchronis&eacute;e, celle-ci est-elle pertinente?
Aw21-04081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-8-1
Aw21-04082=Pour chaque m&eacute;dia temporel synchronis&eacute; ayant une audio-description synchronis&eacute;e, celle-ci est-elle pertinente?
Aw21-04082-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-8-2
Aw21-04091=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement audio a-t-il, si n&eacute;cessaire, une interpr&eacute;tation en langue des signes adapt&eacute;e \u00e0 la langue du m&eacute;dia (hors cas particuliers)?
Aw21-04091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-9-1
Aw21-04092=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; a-t-il, si n&eacute;cessaire, une interpr&eacute;tation en langue des signes adapt&eacute;e \u00e0 la langue du m&eacute;dia (hors cas particuliers)?
Aw21-04092-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-9-2
Aw21-04101=Pour chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; ayant une interpr&eacute;tation en langue des signes, celle-ci est-elle pertinente?
Aw21-04101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-10-1
Aw21-04102=Pour chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement audio ayant une interpr&eacute;tation en langue des signes, celle-ci est-elle pertinente?
Aw21-04102-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-10-2
Aw21-04111=Chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; v&eacute;rifie-t-il, si n&eacute;cessaire, une de ces conditions (hors cas particuliers)?<ul><li> Il existe une audio-description &eacute;tendue synchronis&eacute;e</li><li> Il existe une version alternative avec une audio-description &eacute;tendue synchronis&eacute;e</li></ul>
Aw21-04111-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-11-1
Aw21-04112=Chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement vid&eacute;o v&eacute;rifie-t-il, si n&eacute;cessaire, une de ces conditions (hors cas particuliers)?<ul><li> Il existe une audio-description &eacute;tendue synchronis&eacute;e</li><li> Il existe une version alternative avec une audio-description &eacute;tendue synchronis&eacute;e</li></ul>
Aw21-04112-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-11-2
Aw21-04121=Pour chaque m&eacute;dia temporel synchronis&eacute; pr&eacute;-enregistr&eacute; ayant une audio-description &eacute;tendue synchronis&eacute;e, celle-ci est-elle pertinente?
Aw21-04121-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-12-1
Aw21-04122=Pour chaque m&eacute;dia temporel pr&eacute;-enregistr&eacute; seulement vid&eacute;o ayant une audio-description &eacute;tendue synchronis&eacute;e, celle-ci est-elle pertinente?
Aw21-04122-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-12-2
Aw21-04131=Chaque m&eacute;dia temporel synchronis&eacute; v&eacute;rifie-t-il si n&eacute;cessaire une de ces conditions (hors cas particuliers)?<ul><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li></ul>
Aw21-04131-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-13-1
Aw21-04132=Chaque m&eacute;dia temporel seulement vid&eacute;o v&eacute;rifie-t-il si n&eacute;cessaire une de ces conditions (hors cas particuliers)?<ul><li> Il existe une transcription textuelle accessible via un lien adjacent (une url ou une ancre)</li><li> Il existe une transcription textuelle adjacente clairement identifiable</li></ul>
Aw21-04132-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-13-2
Aw21-04133=Chaque m&eacute;dia temporel synchronis&eacute; ou seulement vid&eacute;o, ins&eacute;r&eacute; via &lt;object&gt; ou &lt;embed&gt; et qui n&eacute;cessite une transcription textuelle v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;object&gt; et &lt;/object&gt;</li><li>Il existe une r&eacute;f&eacute;rence via un lien ou une ancre \u00e0 la transcription textuelle entre &lt;noembed&gt; et &lt;/noembed&gt;</li></ul>
Aw21-04133-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-13-3
Aw21-04141=Pour chaque m&eacute;dia temporel seulement vid&eacute;o ayant une transcription textuelle, celle-ci est-elle pertinente?
Aw21-04141-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-14-1
Aw21-04142=Chaque m&eacute;dia temporel synchronis&eacute; ayant une transcription textuelle, celle-ci est-elle pertinente?
Aw21-04142-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-14-2
Aw21-04151=Chaque m&eacute;dia temporel seulement son, seulement vid&eacute;o ou synchronis&eacute;, v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Le contenu alternatif de la balise object contient une description synth&eacute;tique du contenu</li><li> Le contenu de l&#39;&eacute;l&eacute;ment noembed contient une description synth&eacute;tique du contenu</li><li> Le contenu textuel adjacent permet d&#39;identifier clairement le m&eacute;dia temporel</li></ul>
Aw21-04151-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-15-1
Aw21-04152=Chaque m&eacute;dia temporel seulement son en direct, seulement vid&eacute;o en direct ou synchronis&eacute; en direct, v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Le contenu alternatif de la balise object contient une description synth&eacute;tique du contenu</li><li> Le contenu de l&#39;&eacute;l&eacute;ment noembed contient une description synth&eacute;tique du contenu</li><li>Le contenu textuel adjacent permet d&#39;identifier clairement le m&eacute;dia temporel</li></ul>
Aw21-04152-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-15-2
Aw21-04161=Chaque m&eacute;dia non temporel v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> La balise object contient une alternative</li><li> La balise applet contient une alternative</li><li> La balise noembed contient une alternative</li><li> Un lien adjacent, clairement identifiable, contient l&#39;adresse (url) d&#39;une page contenant une alternative</li><li> Un lien adjacent, clairement identifiable, permet d&#39;acc&eacute;der \u00e0 une alternative dans la page</li></ul>
Aw21-04161-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-16-1
Aw21-04162=Chaque m&eacute;dia non temporel associ&eacute; \u00e0 une alternative v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> La page r&eacute;f&eacute;renc&eacute;e par le lien adjacent est accessible</li><li> L&#39;alternative dans la page, r&eacute;f&eacute;renc&eacute;e par le lien adjacent, est accessible.</li></ul>
Aw21-04162-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-16-2
Aw21-04171=Chaque m&eacute;dia non temporel ayant une alternative v&eacute;rifie-t-il une des ces conditions?<ul><li> Le contenu de la balise object permet d&#39;acc&eacute;der au m&ecirc;me contenu et \u00e0 des fonctionnalit&eacute;s similaires</li><li> Le contenu de la balise applet permet d&#39;acc&eacute;der au m&ecirc;me contenu et \u00e0 des fonctionnalit&eacute;s similaires</li><li> Le contenu de la balise noembed permet d&#39;acc&eacute;der au m&ecirc;me contenu et \u00e0 des fonctionnalit&eacute;s similaires</li><li> Le contenu de l&#39;alternative indiqu&eacute; via un un lien adjacent permet d&#39;acc&eacute;der au m&ecirc;me contenu et \u00e0 des fonctionnalit&eacute;s similaires</li></ul>
Aw21-04171-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-17-1
Aw21-04181=Chaque s&eacute;quence sonore d&eacute;clench&eacute;e automatiquement via une balise object, applet, embed, un code javascript ou une propri&eacute;t&eacute; bgsound v&eacute;rifie-t-il une de ces conditions?<ul><li> La s&eacute;quence sonore a une dur&eacute;e inf&eacute;rieure ou &eacute;gale \u00e0 3 secondes</li><li> La s&eacute;quence sonore peut &ecirc;tre stopp&eacute;e sur action de l&#39;utilisateur</li><li> Le volume de la s&eacute;quence sonore peut &ecirc;tre contr\u00f4l&eacute; par l&#39;utilisateur ind&eacute;pendamment du contr\u00f4le de volume du syst&egrave;me.</li></ul>
Aw21-04181-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-18-1
Aw21-04191=Chaque m&eacute;dia temporel audio pr&eacute;-enregistr&eacute; et diffus&eacute; via une balise Object, Applet, Embed ou propos&eacute; en t&eacute;l&eacute;chargement v&eacute;rifie-t-il une de ces conditions?<ul><li> L&#39;arri&egrave;re-plan sonore peut-&ecirc;tre d&eacute;sactiv&eacute;</li><li> La ou les pistes de dialogue sont 20 d&eacute;cibels plus &eacute;lev&eacute;es que l&#39;arri&egrave;re-plan sonore.</li></ul>
Aw21-04191-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-19-1
Aw21-04201=Chaque m&eacute;dia temporel a-t-il, si n&eacute;cessaire, les fonctionnalit&eacute;s de contr\u00f4le de sa consultation?
Aw21-04201-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-20-1
Aw21-04202=Pour chaque m&eacute;dia temporel, chaque fonctionnalit&eacute; est-elle accessible par le clavier et la souris?
Aw21-04202-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-20-2
Aw21-04203=Pour chaque m&eacute;dia temporel, chaque fonctionnalit&eacute; est-elle activable par le clavier et la souris?
Aw21-04203-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-20-3
Aw21-04211=Pour chaque m&eacute;dia non temporel, chaque fonctionnalit&eacute; est-elle accessible par le clavier et la souris?
Aw21-04211-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-21-1
Aw21-04212=Pour chaque m&eacute;dia non temporel, chaque fonctionnalit&eacute; est-elle activable par le clavier et la souris?
Aw21-04212-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-21-2
Aw21-04221=Chaque m&eacute;dia temporel et non temporel ins&eacute;r&eacute; via une balise Object, Applet ou Embed v&eacute;rifie-t-il une de ces conditions?<ul><li> Le nom, le r\u00f4le, la valeur, le param&eacute;trage et les changements d&#39;&eacute;tats des composants d&#39;interfaces sont accessibles aux aides techniques via une API d&#39;accessibilit&eacute;</li><li> Une alternative compatible avec une API d&#39;accessibilit&eacute; permet d&#39;acc&eacute;der aux m&ecirc;mes fonctionnalit&eacute;s</li></ul>
Aw21-04221-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-4-22-1
Aw21-05021=Pour chaque tableau de donn&eacute;es (balise table) ayant un attribut summary, le contenu de cet attribut est-il pertinent?
Aw21-05021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-2-1
Aw21-05022=Pour chaque tableau de mise en forme (balise table) ayant un attribut summary, le contenu de cet attribut est-il vide (summary="")?
Aw21-05022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-2-2
Aw21-05031=Pour chaque tableau de mise en forme, le contenu lin&eacute;aris&eacute; reste-t-il compr&eacute;hensible?
Aw21-05031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-3-1
Aw21-05051=Pour chaque tableau de donn&eacute;es (balise table) ayant une balise caption, le contenu de cette balise donne-t-il le titre du tableau?
Aw21-05051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-5-1
Aw21-05061=Pour chaque tableau de donn&eacute;es (balise table), chaque en-t&ecirc;te de colonnes a-t-il une balise th?
Aw21-05061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-6-1
Aw21-05062=Pour chaque tableau de donn&eacute;es (balise table), chaque en-t&ecirc;te de lignes a-t-il une balise th?
Aw21-05062-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-6-2
Aw21-05071=Chaque en-t&ecirc;te (balise th) s&#39;appliquant \u00e0 la totalit&eacute; de la ligne ou de la colonne poss&egrave;de-t-elle un attribut id unique ou un attribut scope?
Aw21-05071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-7-1
Aw21-05072=Chaque en-t&ecirc;te (balise th) s&#39;appliquant \u00e0 la totalit&eacute; de la ligne ou de la colonne et poss&eacute;dant un attribut scope v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;en-t&ecirc;te poss&egrave;de un attribut scope avec la valeur "row" pour les en-t&ecirc;tes de ligne</li><li> L&#39;en-t&ecirc;te poss&egrave;de un attribut scope avec la valeur "col" pour les en-t&ecirc;tes de colonne</li></ul>
Aw21-05072-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-7-2
Aw21-05073=Chaque en-t&ecirc;te (balise th) ne s&#39;appliquant pas \u00e0 la totalit&eacute; de la ligne ou de la colonne v&eacute;rifie-t-il ces conditions?<ul><li> L&#39;en-t&ecirc;te ne poss&egrave;de pas d&#39;attribut scope</li><li> L&#39;en-t&ecirc;te poss&egrave;de un attribut id unique</li></ul>
Aw21-05073-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-7-3
Aw21-05074=Chaque cellule (balise td ou th) associ&eacute;e \u00e0 un ou plusieurs en-t&ecirc;tes poss&eacute;dant un attribut id v&eacute;rifie-t-elle ces conditions?<ul><li> La cellule poss&egrave;de un attribut headers</li><li> L&#39;attribut headers poss&egrave;de la liste des valeurs des en-t&ecirc;tes associ&eacute;s \u00e0 la cellule.</li></ul>
Aw21-05074-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-7-4
Aw21-05081=Chaque tableau de mise en forme (balise table) v&eacute;rifie-t-il ces conditions?<ul><li> Le tableau de mise en forme (balise table) ne poss&egrave;de pas de balises caption, th, thead, tfoot</li><li> Les cellules du tableau de mise en forme (balise td) ne poss&egrave;dent pas d&#39;attributs scope, headers, colgroup, axis.</li></ul>
Aw21-05081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-5-8-1
Aw21-06014=Pour chaque lien composite le contexte du lien permet-il d&#39;en comprendre la fonction et la destination (hors cas particuliers)?
Aw21-06014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-1-4
Aw21-06034=Chaque lien composite (contenu texte et de l&#39;attribut alt) est-il explicite hors contexte (hors cas particuliers)?
Aw21-06034-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-3-4
Aw21-06044=Chaque lien identique de type composite a-t-il les m&ecirc;mes fonction et destination?
Aw21-06044-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-4-4
Aw21-06051=Chaque image r&eacute;active c\u00f4t&eacute; serveur (balise img avec l&#39;attribut ismap) v&eacute;rifie-t-elle une de ces conditions?<ul><li> La zone cliquable est doubl&eacute;e d&#39;un lien</li><li> La zone cliquable est doubl&eacute;e d&#39;un formulaire de navigation</li></ul>
Aw21-06051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-5-1
Aw21-06052=Chaque image r&eacute;active c\u00f4t&eacute; serveur (balise img avec l&#39;attribut ismap) v&eacute;rifie-t-elle une de ces conditions?<ul><li> Le lien doublant la zone cliquable permet d&#39;acc&eacute;der \u00e0 la m&ecirc;me fonction et \u00e0 la m&ecirc;me destination que la zone cliquable</li><li> La soumission du formulaire permet d&#39;acc&eacute;der \u00e0 la m&ecirc;me fonction et la m&ecirc;me destination que la zone cliquable. </li></ul>
Aw21-06052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-5-2
Aw21-06053=Chaque image r&eacute;active c\u00f4t&eacute; serveur (balise img avec l&#39;attribut ismap) v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;image r&eacute;active est imm&eacute;diatement suivie, dans le code source, de la liste des liens doublant les zones cliquables</li><li> L&#39;image r&eacute;active est imm&eacute;diatement suivie, dans le code source, d&#39;un formulaire de navigation doublant les zones cliquables</li></ul>
Aw21-06053-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-6-5-3
Aw21-07011=Chaque script v&eacute;rifie-t-il, si n&eacute;cessaire, une de ces conditions (hors cas particuliers)?<ul><li> Une alternative existe entre &lt;noscript&gt; et &lt;/noscript&gt;</li><li> Une alternative existe directement dans la page lorsque javascript est d&eacute;sactiv&eacute;</li><li> Un lien permet d&#39;acc&eacute;der \u00e0 une version alternative de la page</li><li> Une alternative existe via un langage de script c\u00f4t&eacute; serveur</li></ul>
Aw21-07011-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-1-1
Aw21-07012=Chaque script d&eacute;clenchant l&#39;ouverture d&#39;une nouvelle fen&ecirc;tre a-t-il une alternative?
Aw21-07012-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-1-2
Aw21-07021=Chaque script d&eacute;butant par la balise script et ayant une alternative v&eacute;rifie-t-il une de ces conditions?<ul><li> L&#39;alternative entre &lt;noscript&gt; et &lt;/noscript&gt; permet d&#39;acc&eacute;der \u00e0 des contenus et des fonctionnalit&eacute;s similaires</li><li> La page affich&eacute;e, lorsque javascript est d&eacute;sactiv&eacute;, permet d&#39;acc&eacute;der \u00e0 des contenus et des fonctionnalit&eacute;s similaires</li><li> La page alternative permet d&#39;acc&eacute;der \u00e0 des contenus et des fonctionnalit&eacute;s similaires</li><li> Le langage de script c\u00f4t&eacute; serveur permet d&#39;acc&eacute;der \u00e0 des contenus et des fonctionnalit&eacute;s similaires </li></ul>
Aw21-07021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-2-1
Aw21-07022=Chaque &eacute;l&eacute;ment non textuel mis \u00e0 jour par un script (dans la page, un cadre ou un cadre en ligne) et ayant une alternative v&eacute;rifie-t-il ces conditions?<ul><li> L&#39;alternative de l&#39;&eacute;l&eacute;ment non textuel est mise \u00e0 jour</li><li> L&#39;alternative mise \u00e0 jour est pertinente</li></ul>
Aw21-07022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-2-2
Aw21-07031=Chaque &eacute;l&eacute;ment poss&eacute;dant un gestionnaire d&#39;&eacute;v&eacute;nement contr\u00f4l&eacute; par un script v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;&eacute;l&eacute;ment est accessible par le clavier et la souris</li><li> Un &eacute;l&eacute;ment accessible par le clavier et la souris permettant de r&eacute;aliser la m&ecirc;me action est pr&eacute;sent dans la page</li></ul>
Aw21-07031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-3-1
Aw21-07032=Chaque &eacute;l&eacute;ment poss&eacute;dant un gestionnaire d&#39;&eacute;v&eacute;nement contr\u00f4l&eacute; par un script v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;&eacute;l&eacute;ment est activable par le clavier et la souris</li><li> Un &eacute;l&eacute;ment activable par le clavier et la souris permettant de r&eacute;aliser la m&ecirc;me action est pr&eacute;sent dans la page</li></ul>
Aw21-07032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-3-2
Aw21-07033=Un script ne doit pas supprimer le focus d&#39;un &eacute;l&eacute;ment qui le re\u00e7oit. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-07033-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-3-3
Aw21-07041=Chaque script qui g&eacute;n&egrave;re ou contr\u00f4le un composant d&#39;interface v&eacute;rifie-t-il, si n&eacute;cessaire, une de ces conditions?<ul><li> Le nom, le r\u00f4le, la valeur, le param&eacute;trage et les changements d&#39;&eacute;tats sont accessibles aux technologies d&#39;assistance via une API d&#39;accessibilit&eacute;</li><li> Un composant d&#39;interface accessible permettant d&#39;acc&eacute;der aux m&ecirc;mes fonctionnalit&eacute;s est pr&eacute;sent dans la page</li><li> Une alternative accessible permet d&#39;acc&eacute;der aux m&ecirc;mes fonctionnalit&eacute;s.</li></ul>
Aw21-07041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-4-1
Aw21-07042=Chaque fonctionnalit&eacute; d&#39;insertion de contenu contr\u00f4l&eacute; par un script utilise-t-elle, si possible, des propri&eacute;t&eacute;s et m&eacute;thodes conformes \u00e0 la sp&eacute;cification DOM (Document Object Model)?
Aw21-07042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-4-2
Aw21-07061=Chaque script qui provoque une alerte non sollicit&eacute;e est-il contr\u00f4lable par l&#39;utilisateur (hors cas particuliers)?
Aw21-07061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-7-6-1
Aw21-08013=Pour chaque page Web poss&eacute;dant une d&eacute;claration de type de document, celle-ci est-elle situ&eacute;e avant la balise HTML dans le code source?
Aw21-08013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-1-3
Aw21-08021=Pour chaque d&eacute;claration de type de document, le code source de la page v&eacute;rifie-t-il ces conditions?<ul><li> Les balises respectent les r&egrave;gles d&#39;&eacute;criture</li><li> L&#39;imbrication des balises est conforme</li><li> L&#39;ouverture et la fermeture des balises sont conformes</li><li> Les attributs respectent les r&egrave;gles d&#39;&eacute;criture</li><li> Les valeurs des attributs respectent les r&egrave;gles d&#39;&eacute;criture</li></ul>
Aw21-08021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-2-1
Aw21-08022=Pour chaque d&eacute;claration de type de document, le code source de la page ne doit pas utiliser d&#39;&eacute;l&eacute;ments obsol&egrave;tes. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-08022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-2-2
Aw21-08071=Dans chaque page Web, chaque texte &eacute;crit dans une langue diff&eacute;rente de la langue par d&eacute;faut v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;indication de langue est donn&eacute;e sur l&#39;&eacute;l&eacute;ment contenant le texte</li><li> L&#39;indication de langue est donn&eacute;e sur un des &eacute;l&eacute;ments parents</li></ul>
Aw21-08071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-7-1
Aw21-08081=Dans chaque page Web, chaque changement de langue (attribut lang et/ou xml:lang) est-t-il valide?
Aw21-08081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-8-1
Aw21-08082=Dans chaque page Web, chaque changement de langue (attribut lang et/ou xml:lang) est-t-il pertinent?
Aw21-08082-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-8-2
Aw21-08091=Dans chaque page Web les balises (\u00e0 l&#39;exception de div, span et table) ne doivent pas &ecirc;tre utilis&eacute;es uniquement \u00e0 des fins de pr&eacute;sentation. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-08091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-9-1
Aw21-08101=Dans chaque page Web, chaque texte dont le sens de lecture est diff&eacute;rent du sens de lecture par d&eacute;faut v&eacute;rifie-t-il ces conditions?<ul><li> Le texte est contenu dans un &eacute;l&eacute;ment poss&eacute;dant un attribut dir</li><li> La valeur de l&#39;attribut dit est conforme (rtl ou ltr)</li><li> La valeur de l&#39;attribut dir est pertinente</li></ul>
Aw21-08101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-8-10-1
Aw21-09013=Dans chaque page Web, chaque titre (balise h) n&eacute;cessaire \u00e0 la structure de l&#39;information est-il pr&eacute;sent?
Aw21-09013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-1-3
Aw21-09014=Dans chaque page Web, chaque titre (balise h) est-il pertinent?
Aw21-09014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-1-4
Aw21-09023=Dans chaque page Web, les informations regroup&eacute;es sous forme de listes de d&eacute;finitions utilisent-elles les balises dl et dt/dd?
Aw21-09023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-2-3
Aw21-09031= Dans chaque page Web, la premi&egrave;re occurrence de chaque acronyme v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;acronyme est accompagn&eacute; de sa signification sous forme d&#39;un texte adjacent</li><li> L&#39;acronyme est impl&eacute;ment&eacute; via un lien r&eacute;f&eacute;ren\u00e7ant une page ou un emplacement dans la page qui permet d&#39;en conna\u00eetre la signification</li><li> L&#39;acronyme fait partie d&#39;un lien poss&eacute;dant un attribut title qui permet d&#39;en conna\u00eetre la signification</li><li> La signification de l&#39;acronyme est pr&eacute;sente dans un glossaire pr&eacute;sent sur le site</li><li> L&#39;acronyme est impl&eacute;ment&eacute; via une balise acronym poss&eacute;dant un title qui permet d&#39;en conna\u00eetre la signification</li></ul>
Aw21-09031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-3-1
Aw21-09032=Dans chaque page Web, la premi&egrave;re occurrence de chaque abr&eacute;viation v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;abr&eacute;viation est accompagn&eacute;e de sa signification sous forme d&#39;un texte adjacent</li><li> L&#39;abr&eacute;viation est impl&eacute;ment&eacute;e via un lien r&eacute;f&eacute;ren\u00e7ant une page ou un emplacement dans la page qui permet d&#39;en conna\u00eetre la signification</li><li> L&#39;abr&eacute;viation fait partie d&#39;un lien poss&eacute;dant un attribut title qui permet d&#39;en conna\u00eetre la signification</li><li> La signification de l&#39;abr&eacute;viation est pr&eacute;sente dans un glossaire pr&eacute;sent sur le site</li><li> L&#39;abr&eacute;viation est impl&eacute;ment&eacute;e via une balise abbr poss&eacute;dant un title qui permet d&#39;en conna\u00eetre la signification</li></ul>
Aw21-09032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-3-2
Aw21-09041=Dans chaque page Web, la signification de chaque acronyme est-elle pertinente?
Aw21-09041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-4-1
Aw21-09042=Dans chaque page Web, la signification de chaque abr&eacute;viation est-elle pertinente?
Aw21-09042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-4-2
Aw21-09051=Dans chaque page Web, chaque citation courte utilise-t-elle une balise q?
Aw21-09051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-5-1
Aw21-09052=Dans chaque page Web, chaque bloc de citation utilise-t-il une balise blockquote?
Aw21-09052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-9-5-2
Aw21-10013=Dans chaque page Web, l&#39;utilisation des espaces v&eacute;rifie-t-elle ces conditions?<ul><li> Les espaces ne sont pas utilis&eacute;s pour s&eacute;parer les lettres d&#39;un mot</li><li> Les espaces ne sont pas utilis&eacute;s pour simuler des tableaux</li><li> Les espaces ne sont pas utilis&eacute;s pour simuler des colonnes de texte</li></ul>
Aw21-10013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-1-3
Aw21-10021=Dans chaque page Web, l&#39;information reste-t-elle pr&eacute;sente lorsque les feuilles de styles sont d&eacute;sactiv&eacute;es?
Aw21-10021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-2-1
Aw21-10022=Dans chaque page Web, l&#39;information reste-t-elle visible lorsque les images sont d&eacute;sactiv&eacute;es?
Aw21-10022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-2-2
Aw21-10023=Dans chaque page Web, l&#39;information reste-t-elle visible lorsque les couleurs sont d&eacute;sactiv&eacute;es?
Aw21-10023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-2-3
Aw21-10031=Dans chaque page Web, l&#39;information reste-t-elle compr&eacute;hensible lorsque les feuilles de styles sont d&eacute;sactiv&eacute;es?
Aw21-10031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-3-1
Aw21-10042=Dans les feuilles de styles du site Web, les tailles de polices utilisent-elles uniquement des unit&eacute;s relatives?
Aw21-10042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-4-2
Aw21-10043=Dans chaque page Web, l&#39;augmentation de la taille des caract&egrave;res jusqu&#39;\u00e0 200%, au moins, ne doit pas provoquer de perte d&#39;information. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10043-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-4-3
Aw21-10051=Dans chaque page Web, chaque d&eacute;claration CSS de couleurs de police (color), d&#39;un &eacute;l&eacute;ment susceptible de contenir du texte, est-elle accompagn&eacute;e d&#39;une d&eacute;claration de couleur de fond (background, background-color), au moins, h&eacute;rit&eacute;e d&#39;un parent?
Aw21-10051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-5-1
Aw21-10052=Dans chaque page Web, chaque d&eacute;claration de couleur de fond (background, background-color), d&#39;un &eacute;l&eacute;ment susceptible de contenir du texte, est-elle accompagn&eacute;e d&#39;une d&eacute;claration de couleur de police (color) au moins, h&eacute;rit&eacute;e d&#39;un parent?
Aw21-10052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-5-2
Aw21-10053=Dans chaque page Web, chaque utilisation d&#39;une image pour cr&eacute;er une couleur de fond d&#39;un &eacute;l&eacute;ment susceptible de contenir du texte, via CSS (background, background-image), est-elle accompagn&eacute;e d&#39;une d&eacute;claration de couleur de fond (background, background-color), au moins, h&eacute;rit&eacute;e d&#39;un parent?
Aw21-10053-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-5-3
Aw21-10061=Dans chaque page Web, chaque lien texte signal&eacute; uniquement par la couleur et dont la nature n&#39;est pas &eacute;vidente a-t-il un rapport de contraste sup&eacute;rieur ou &eacute;gal \u00e0 3:1 par rapport au texte environnant?
Aw21-10061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-6-1
Aw21-10071=Pour chaque &eacute;l&eacute;ment recevant le focus, l&#39;indication visuelle du navigateur ne doit pas &ecirc;tre supprim&eacute;e (propri&eacute;t&eacute; CSS outline, outline-color, outline-width, outline-style). Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-7-1
Aw21-10072=Pour chaque &eacute;l&eacute;ment recevant le focus, l&#39;indication visuelle du navigateur ne doit pas &ecirc;tre d&eacute;grad&eacute;e (propri&eacute;t&eacute; CSS outline-color). Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10072-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-7-2
Aw21-10073=Chaque lien dans un texte signal&eacute; par la couleur uniquement v&eacute;rifie-t-il ces conditions?<ul><li>Une indication visuelle autre que la couleur permet de signaler la prise de focus au clavier.</li><li>Une indication visuelle autre que la couleur permet de signaler le survol du lien \u00e0 la souris.</li></ul>
Aw21-10073-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-7-3
Aw21-10081=Pour chaque bloc de texte contenu dans un &eacute;l&eacute;ment HTML, la couleur de fond est-elle contr\u00f4lable par l&#39;utilisateur?
Aw21-10081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-8-1
Aw21-10082=Pour chaque bloc de texte contenu dans un &eacute;l&eacute;ment HTML, la couleur de police est-elle contr\u00f4lable par l&#39;utilisateur?
Aw21-10082-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-8-2
Aw21-10083=Pour chaque bloc de texte contenu dans un &eacute;l&eacute;ment object, applet ou embed, la couleur de fond est-elle contr\u00f4lable par l&#39;utilisateur?
Aw21-10083-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-8-3
Aw21-10084=Pour chaque bloc de texte contenu dans un &eacute;l&eacute;ment object, applet ou embed, la couleur de police est-elle contr\u00f4lable par l&#39;utilisateur?
Aw21-10084-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-8-4
Aw21-10091=Chaque page Web v&eacute;rifie-t-elle une de ces conditions?<ul><li>Le texte n\u2019est pas justifi&eacute;</li><li>Un m&eacute;canisme permet \u00e0 l\u2019utilisateur de supprimer la justification du texte</li></ul>
Aw21-10091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-9-1
Aw21-10101=Dans chaque page Web, l&#39;augmentation de la taille des caract&egrave;res \u00e0 200% v&eacute;rifie-t-elle une de ces conditions?<ul><li> En affichage plein &eacute;cran, pour lire un bloc de texte, l&#39;utilisation de la barre de d&eacute;filement horizontal n&#39;est pas n&eacute;cessaire</li><li> Un m&eacute;canisme permet de rendre inutile l&#39;utilisation de la barre de d&eacute;filement horizontal pour lire un bloc de texte en affichage plein &eacute;cran</li></ul>
Aw21-10101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-10-1
Aw21-10111=Pour chaque page Web, chaque bloc de texte v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Chaque bloc de texte a une largeur inf&eacute;rieure ou &eacute;gale \u00e0 80 caract&egrave;res</li><li> L&#39;utilisateur peut r&eacute;duire la largeur de chaque bloc de texte \u00e0 80 caract&egrave;res en redimensionnant la fen&ecirc;tre de son navigateur</li></ul>
Aw21-10111-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-11-1
Aw21-10121=Pour chaque page Web, chaque bloc de texte v&eacute;rifie-t-il une de ces conditions?<ul><li> La valeur de l&#39;interligne est &eacute;gale \u00e0 1,5 fois la taille du texte, au moins</li><li> Un m&eacute;canisme permet d&#39;augmenter la valeur de l&#39;interligne \u00e0 1,5 fois la taille du texte, au moins</li></ul>
Aw21-10121-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-12-1
Aw21-10122=Pour chaque page Web, chaque bloc de texte v&eacute;rifie-t-il une de ces conditions?<ul><li> La valeur de l&#39;espacement entre deux paragraphe est &eacute;gale \u00e0 1,5 fois la valeur de l&#39;interligne, au moins</li><li>Un m&eacute;canisme permet d&#39;augmenter la valeur de l&#39;espacement entre deux paragraphes \u00e0 1,5 fois la valeur de l&#39;interligne, au moins</li></ul>
Aw21-10122-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-12-2
Aw21-10131=Dans chaque page Web, chaque texte cach&eacute; (propri&eacute;t&eacute; display:none ou visibility:hidden) v&eacute;rifie-t-il une de ces conditions?<ul><li>Le texte n&#39;a pas vocation \u00e0 &ecirc;tre restitu&eacute; par les technologies d&#39;assistance</li><li> Le texte est rendu visible sur action de l&#39;utilisateur sur l&#39;&eacute;l&eacute;ment lui-m&ecirc;me ou un &eacute;l&eacute;ment pr&eacute;c&eacute;dent le texte cach&eacute;</li></ul>
Aw21-10131-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-13-1
Aw21-10141=Dans chaque page Web, pour chaque texte ou ensemble de texte, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la forme ou la position. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10141-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-14-1
Aw21-10142=Dans chaque page Web, pour chaque image ou ensemble d&#39;image, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la forme ou la position. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10142-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-14-2
Aw21-10143=Dans chaque page Web, pour chaque m&eacute;dia temporel, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la forme ou la position. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10143-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-14-3
Aw21-10144=Dans chaque page Web, pour chaque m&eacute;dia non temporel, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la forme ou la position. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-10144-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-14-4
Aw21-10151=Dans chaque page Web, pour chaque texte ou ensemble de textes, l&#39;information ne doit pas &ecirc;tre donn&eacute;e uniquement par la forme ou la position. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-10151-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-15-1
Aw21-10152=Dans chaque page Web, pour chaque image ou ensemble d&#39;images, l&#39;information ne doit pas &ecirc;tre donn&eacute;e par la forme ou la position uniquement. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-10152-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-15-2
Aw21-10153=Dans chaque page Web, pour chaque m&eacute;dia temporel, l&#39;information ne doit pas &ecirc;tre donn&eacute;e par la forme ou la position uniquement. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-10153-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-15-3
Aw21-10154=Dans chaque page Web, pour chaque m&eacute;dia non temporel, l&#39;information ne doit pas &ecirc;tre donn&eacute;e par la forme ou la position uniquement. Cette r&egrave;gle est-elle impl&eacute;ment&eacute;e de fa\u00e7on pertinente?
Aw21-10154-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-10-15-4
Aw21-11021=Chaque &eacute;tiquette (balise label) permet-elle de conna\u00eetre la fonction exacte du champ de formulaire (balise input de type text, password, checkbox, radio, file ou balises textarea et select) auquel elle est associ&eacute;e?
Aw21-11021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-2-1
Aw21-11022=Chaque attribut title permet-il de conna\u00eetre la fonction exacte du champ de formulaire (balise input de type text, password, checkbox, radio, file ou balises textarea et select) auquel il est associ&eacute;?
Aw21-11022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-2-2
Aw21-11031=Chaque &eacute;tiquette associ&eacute;e \u00e0 un champ de formulaire ayant la m&ecirc;me fonction et r&eacute;p&eacute;t&eacute;e plusieurs fois dans une m&ecirc;me page est-elle coh&eacute;rente?
Aw21-11031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-3-1
Aw21-11032=Chaque &eacute;tiquette associ&eacute;e \u00e0 un champ de formulaire ayant la m&ecirc;me fonction et r&eacute;p&eacute;t&eacute;e dans un ensemble de pages est-elle coh&eacute;rente?
Aw21-11032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-3-2
Aw21-11041=Dans chaque formulaire, chaque &eacute;tiquette de champ et son champ associ&eacute; sont-ils accol&eacute;s?
Aw21-11041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-4-1
Aw21-11051=Dans chaque formulaire, les informations de m&ecirc;me nature sont-elles regroup&eacute;es via une balise fieldset, si n&eacute;cessaire?
Aw21-11051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-5-1
Aw21-11071=Dans chaque formulaire, chaque l&eacute;gende (balise legend) associ&eacute;e \u00e0 un groupement de champs de formulaire (balise fieldset) est-elle pertinente?
Aw21-11071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-7-1
Aw21-11081=Dans chaque formulaire, pour chaque liste de choix (balise select), les items sont-ils regroup&eacute;s avec une balise optgroup, si n&eacute;cessaire?
Aw21-11081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-8-1
Aw21-11083=Pour chaque regroupement d&#39;items de liste (balise optgroup) ayant un attribut label, le contenu de l&#39;attribut label est-il pertinent?
Aw21-11083-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-8-3
Aw21-11091=Dans chaque formulaire, l&#39;intitul&eacute; de chaque bouton v&eacute;rifie-t-il une de ces conditions?<ul><li> Le contenu de l&#39;attribut value des boutons de formulaire de type submit, reset ou button est pertinent</li><li> Le contenu de la balise &lt;button&gt; est pertinent</li><li> Le contenu de l&#39;attribut title est pertinent</li></ul>
Aw21-11091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-9-1
Aw21-11101=Pour chaque formulaire, les champs obligatoires sont-ils signal&eacute;s de mani&egrave;re pertinente?
Aw21-11101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-10-1
Aw21-11102=Pour chaque formulaire, les erreurs de saisie sont-elles indiqu&eacute;es de mani&egrave;re pertinente?
Aw21-11102-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-10-2
Aw21-11103=Pour chaque formulaire, pour chaque champ obligatoire, le type de donn&eacute;e et/ou de format est-il indiqu&eacute;, si n&eacute;cessaire?
Aw21-11103-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-10-3
Aw21-11111=Pour chaque formulaire, pour chaque erreur de saisie, les types et les formats de donn&eacute;es sont-ils sugg&eacute;r&eacute;s, si n&eacute;cessaire?
Aw21-11111-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-11-1
Aw21-11112=Pour chaque formulaire, pour chaque erreur de saisie, des exemples de valeurs attendues sont-ils sugg&eacute;r&eacute;s, lorsque c&#39;est possible?
Aw21-11112-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-11-2
Aw21-11121=Pour chaque formulaire, la saisie des donn&eacute;es \u00e0 caract&egrave;re financier, juridique ou personnelle v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;utilisateur peut modifier ou annuler les donn&eacute;es et les actions effectu&eacute;es sur ces donn&eacute;es apr&egrave;s leur saisie</li><li> L&#39;utilisateur peut v&eacute;rifier et corriger les donn&eacute;es avant la validation du formulaire</li><li> Un m&eacute;canisme de confirmation explicite, via un champ de formulaire ou une &eacute;tape suppl&eacute;mentaire, est pr&eacute;sent</li></ul>
Aw21-11121-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-12-1
Aw21-11122=Pour chaque formulaire, la suppression des donn&eacute;es \u00e0 caract&egrave;re financier, juridique ou personnelle v&eacute;rifie-t-elle une de ces conditions?<ul><li> Un m&eacute;canisme permet de r&eacute;cup&eacute;rer les donn&eacute;es supprim&eacute;es par l&#39;utilisateur</li><li> Un m&eacute;canisme de confirmation explicite de la suppression, via un champ de formulaire ou une &eacute;tape suppl&eacute;mentaire, est pr&eacute;sent</li></ul>
Aw21-11122-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-12-2
Aw21-11131=Pour chaque formulaire, la saisie des donn&eacute;es v&eacute;rifie-t-elle une de ces conditions?<ul><li> L&#39;utilisateur peut modifier ou annuler les donn&eacute;es et les actions effectu&eacute;es sur ces donn&eacute;es apr&egrave;s leur saisie</li><li> L&#39;utilisateur peut v&eacute;rifier et corriger les donn&eacute;es avant la validation du formulaire</li><li> Un m&eacute;canisme de confirmation explicite, via un champ de formulaire ou une &eacute;tape suppl&eacute;mentaire, est pr&eacute;sent</li></ul>
Aw21-11131-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-13-1
Aw21-11132=Pour chaque formulaire, la suppression des donn&eacute;es v&eacute;rifie-t-elle une de ces conditions?<ul><li> Un m&eacute;canisme permet de r&eacute;cup&eacute;rer les donn&eacute;es supprim&eacute;es par l&#39;utilisateur</li><li> Un m&eacute;canisme de confirmation explicite de la suppression, via un champ de formulaire ou une &eacute;tape suppl&eacute;mentaire, est pr&eacute;sent</li></ul>
Aw21-11132-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-13-2
Aw21-11141=Chaque formulaire v&eacute;rifie-t-il une de ces conditions?<ul><li>Il existe un lien vers une page d&#39;aide</li><li>Il existe des indications avant le formulaire</li><li>Il existe des indications avant les champs de formulaire</li><li>Un assistant est disponible</li></ul>
Aw21-11141-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-14-1
Aw21-11142=Chaque champ de type texte v&eacute;rifie-t-il, si n&eacute;cessaire, l\u2019une de ces conditions?<ul><li>Un correcteur orthographique est disponible</li><li>Des suggestions de saisie sont disponibles</li></ul>
Aw21-11142-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-14-2
Aw21-11151=Pour chaque formulaire, chaque aide \u00e0 la saisie est-elle pertinente?
Aw21-11151-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-11-15-1
Aw21-12011=Chaque ensemble de pages v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> Un menu de navigation et un plan du site sont pr&eacute;sents</li><li> Un menu de navigation et un moteur de recherche sont pr&eacute;sents</li><li> Un moteur de recherche et un plan du site sont pr&eacute;sents</li></ul>
Aw21-12011-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-1-1
Aw21-12021=Dans chaque ensemble de pages, chaque page ayant un menu de navigation v&eacute;rifie-t-elle ces conditions (hors cas particuliers)?<ul><li> Le menu de navigation est toujours \u00e0 la m&ecirc;me place dans la pr&eacute;sentation</li><li> Le menu de navigation se pr&eacute;sente toujours dans le m&ecirc;me ordre relatif dans le code source.</li></ul>
Aw21-12021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-2-1
Aw21-12022=Chaque barre de navigation r&eacute;p&eacute;t&eacute;e dans un ensemble de page v&eacute;rifie-t-elle ces conditions (hors cas particuliers)?<ul><li> La barre de navigation est toujours \u00e0 la m&ecirc;me place dans la pr&eacute;sentation </li><li> La barre de navigation se pr&eacute;sente toujours dans le m&ecirc;me ordre relatif dans le code source. </li></ul>
Aw21-12022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-2-2
Aw21-12031=Dans chaque ensemble de pages, le menu de navigation principal a-t-il une pr&eacute;sentation coh&eacute;rente (hors cas particuliers)?
Aw21-12031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-3-1
Aw21-12032=Dans chaque ensemble de pages, les barres de navigation r&eacute;p&eacute;t&eacute;es ont-elles une pr&eacute;sentation coh&eacute;rente (hors cas particuliers)?
Aw21-12032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-3-2
Aw21-12041=La page "plan du site" est-elle repr&eacute;sentative de l&#39;architecture g&eacute;n&eacute;rale du site?
Aw21-12041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-4-1
Aw21-12042=Les liens du plan du site sont-ils fonctionnels?
Aw21-12042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-4-2
Aw21-12043=Les liens du plan du site renvoient-ils bien vers les pages indiqu&eacute;es par l&#39;intitul&eacute;?
Aw21-12043-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-4-3
Aw21-12051=Dans chaque ensemble de pages, la page "plan du site" est-elle accessible \u00e0 partir d&#39;une fonctionnalit&eacute; identique?
Aw21-12051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-5-1
Aw21-12052=Dans chaque ensemble de pages, la fonctionnalit&eacute; vers la page "plan du site" est-elle situ&eacute;e \u00e0 la m&ecirc;me place dans la pr&eacute;sentation?
Aw21-12052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-5-2
Aw21-12053=Dans chaque ensemble de pages, la fonctionnalit&eacute; vers la page "plan du site" se pr&eacute;sente-t-elle toujours dans le m&ecirc;me ordre relatif dans le code source?
Aw21-12053-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-5-3
Aw21-12061=Dans chaque ensemble de pages, le moteur de recherche est-il accessible \u00e0 partir d&#39;une fonctionnalit&eacute; identique?
Aw21-12061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-6-1
Aw21-12062=Dans chaque ensemble de pages, la fonctionnalit&eacute; vers le moteur de recherche est-elle situ&eacute;e \u00e0 la m&ecirc;me place dans la pr&eacute;sentation?
Aw21-12062-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-6-2
Aw21-12063=Dans chaque ensemble de pages, la fonctionnalit&eacute; vers le moteur de recherche se pr&eacute;sente-t-elle toujours dans le m&ecirc;me ordre relatif dans le code source?
Aw21-12063-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-6-3
Aw21-12071=Chaque page d&#39;une collection de pages, v&eacute;rifie-t-elle ces conditions?<ul><li>Un lien permet d&#39;acc&eacute;der \u00e0 la page suivante</li><li>Un lien permet d&#39;acc&eacute;der \u00e0 la page pr&eacute;c&eacute;dente</li><li>Des liens permettent d&#39;acc&eacute;der \u00e0 chaque page de la collection de pages</li></ul>
Aw21-12071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-7-1
Aw21-12081=Dans chaque page web, un fil d&#39;Ariane est-il pr&eacute;sent?
Aw21-12081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-8-1
Aw21-12091=Dans chaque page Web, le fil d&#39;Ariane est-il repr&eacute;sentatif de la position de la page dans l&#39;arborescence du site?
Aw21-12091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-9-1
Aw21-12101=Dans chaque page Web, chaque groupe de liens importants est-il impl&eacute;ment&eacute; dans un &eacute;l&eacute;ment commun?
Aw21-12101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-10-1
Aw21-12102=Dans chaque page Web, chaque groupe de liens importants v&eacute;rifie-t-il une de ces conditions?<ul><li> L&#39;&eacute;l&eacute;ment structurant le groupe de liens importants poss&egrave;de un attribut Id</li><li> L&#39;&eacute;l&eacute;ment structurant le groupe de liens important est imm&eacute;diatement pr&eacute;c&eacute;d&eacute;, dans le code source, d&#39;une ancre nomm&eacute;e</li><li> Le premier lien du groupe est imm&eacute;diatement pr&eacute;c&eacute;d&eacute;, dans le code source, d&#39;une ancre nomm&eacute;e</li></ul>
Aw21-12102-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-10-2
Aw21-12103=Dans chaque page Web, la zone de contenu v&eacute;rifie-t-elle une de ces conditions?<ul><li> La zone de contenu poss&egrave;de un attribut Id</li><li> La zone de contenu est imm&eacute;diatement pr&eacute;c&eacute;d&eacute;e, dans le code source, d&#39;une ancre nomm&eacute;e</li><li> Le premier &eacute;l&eacute;ment de la zone de contenu est imm&eacute;diatement pr&eacute;c&eacute;d&eacute;, dans le code source, d&#39;une ancre nomm&eacute;e</li></ul>
Aw21-12103-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-10-3
Aw21-12111=Dans chaque page Web, un lien permet-il d&#39;&eacute;viter chaque groupe de liens importants identifi&eacute; ou d&#39;y acc&eacute;der?
Aw21-12111-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-11-1
Aw21-12112=Dans chaque page Web, un lien permet-il d&#39;&eacute;viter la zone de contenu identifi&eacute;e ou d&#39;y acc&eacute;der?
Aw21-12112-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-11-2
Aw21-12113=Dans chaque page Web, chaque lien d&#39;&eacute;vitement ou d&#39;acc&egrave;s rapide est-il fonctionnel?
Aw21-12113-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-11-3
Aw21-12114=Dans chaque page Web, les liens d&#39;&eacute;vitements ou d&#39;acc&egrave;s rapide v&eacute;rifient-t-ils ces conditions?<ul><li> Chaque lien est situ&eacute; \u00e0 la m&ecirc;me place dans la pr&eacute;sentation</li><li> Chaque lien se pr&eacute;sente toujours dans le m&ecirc;me ordre relatif dans le code source</li></ul>
Aw21-12114-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-11-4
Aw21-12121=Dans chaque page Web, la page en cours de consultation est-elle indiqu&eacute;e dans le menu de navigation?
Aw21-12121-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-12-1
Aw21-12131=Dans chaque page Web, l&#39;ordre de tabulation dans le contenu est-il coh&eacute;rent?
Aw21-12131-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-13-1
Aw21-12132=Pour chaque script qui met \u00e0 jour ou ins&egrave;re un contenu, l&#39;ordre de tabulation reste-t-il coh&eacute;rent?
Aw21-12132-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-13-2
Aw21-12141=Dans chaque page Web, chaque &eacute;l&eacute;ment recevant le focus v&eacute;rifie-t-il une de ces conditions?<ul><li> Il est possible d&#39;atteindre l&#39;&eacute;l&eacute;ment suivant ou pr&eacute;c&eacute;dent pouvant recevoir le focus avec la touche de tabulation</li><li> L&#39;utilisateur est inform&eacute; d&#39;un m&eacute;canisme fonctionnel permettant d&#39;atteindre au clavier l&#39;&eacute;l&eacute;ment suivant ou pr&eacute;c&eacute;dent pouvant recevoir le focus</li></ul>
Aw21-12141-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-12-14-1
Aw21-13011=Pour chaque page Web, chaque proc&eacute;d&eacute; de rafra\u00eechissement ou de redirection automatique (code, script, balise object, balise applet, balise meta) v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;utilisateur peut arr&ecirc;ter ou relancer le rafra\u00eechissement</li><li> L&#39;utilisateur peut augmenter la limite de temps entre deux rafra\u00eechissements de dix fois, au moins</li><li> L&#39;utilisateur est averti de l&#39;imminence du rafra\u00eechissement et dispose de vingt secondes, au moins, pour augmenter la limite de temps avant le prochain rafraichissement</li><li> La limite de temps entre deux rafra\u00eechissements est de vingt heures, au moins </li></ul>
Aw21-13011-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-1-1
Aw21-13012=Pour chaque page Web, chaque proc&eacute;d&eacute; de redirection effectu&eacute; via une balise m&eacute;ta est-il imm&eacute;diat (hors cas particuliers)?
Aw21-13012-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-1-2
Aw21-13013=Pour chaque page Web, chaque proc&eacute;d&eacute; de redirection effectu&eacute; via un script v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;utilisateur peut arr&ecirc;ter ou relancer la redirection</li><li> L&#39;utilisateur peut augmenter la limite de temps avant la redirection de dix fois, au moins</li><li> L&#39;utilisateur est averti de l&#39;imminence de la redirection et dispose de vingt secondes, au moins, pour augmenter la limite de temps avant la prochaine redirection</li><li> La limite de temps avant la redirection est de vingt heures, au moins</li></ul>
Aw21-13013-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-1-3
Aw21-13014=Pour chaque page Web, chaque proc&eacute;d&eacute; de redirection effectu&eacute; c\u00f4t&eacute; serveur v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li> L&#39;utilisateur peut arr&ecirc;ter ou relancer la redirection</li><li> L&#39;utilisateur peut augmenter la limite de temps avant la redirection de dix fois, au moins</li><li> L&#39;utilisateur est averti de l&#39;imminence de la redirection et dispose de vingt secondes, au moins, pour augmenter la limite de temps avant la prochaine redirection</li><li> La limite de temps avant la redirection est de vingt heures, au moins</li></ul>
Aw21-13014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-1-4
Aw21-13015=Pour chaque page Web, chaque proc&eacute;d&eacute; limitant le temps d\u2019une session v&eacute;rifie-t-il une de ces conditions (hors cas particuliers)?<ul><li>L\u2019utilisateur peut supprimer la limite de temps</li><li>L\u2019utilisateur peut augmenter la limite de temps</li><li>La limite de temps avant la fin de la session est de vingt heures au moins.</li></ul>
Aw21-13015-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-1-5
Aw21-13021=Dans chaque page Web, pour chaque ouverture d&#39;une nouvelle fen&ecirc;tre effectu&eacute;e via un lien (attribut target="_blank") ou une commande javascript, l&#39;utilisateur est-il averti?
Aw21-13021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-2-1
Aw21-13022=Dans chaque page Web, pour chaque ouverture d&#39;une nouvelle fen&ecirc;tre effectu&eacute;e via une balise object, applet ou embed, l&#39;utilisateur est-il averti?
Aw21-13022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-2-2
Aw21-13023=Dans chaque page Web, pour chaque ouverture d&#39;une nouvelle fen&ecirc;tre effectu&eacute;e via un contr\u00f4le de formulaire, l&#39;utilisateur est-il averti?
Aw21-13023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-2-3
Aw21-13031=Dans chaque page Web, l&#39;ouverture d&#39;une nouvelle fen&ecirc;tre ne doit pas &ecirc;tre d&eacute;clench&eacute;e sans action de l&#39;utilisateur. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-13031-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-3-1
Aw21-13041=Dans chaque page Web, chaque t\u00e2che limit&eacute;e dans le temps v&eacute;rifie-t-elle une de ces conditions?<ul><li> La t\u00e2che se d&eacute;roule en temps r&eacute;el</li><li> La t\u00e2che requiert une limite de temps essentielle \u00e0 son bon d&eacute;roulement</li></ul>
Aw21-13041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-4-1
Aw21-13051=Dans chaque page Web, lors d&#39;une interruption de session authentifi&eacute;e, les donn&eacute;es saisies par l&#39;utilisateur sont-elles r&eacute;cup&eacute;r&eacute;es apr&egrave;s r&eacute;-authentification?
Aw21-13051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-5-1
Aw21-13061=Dans chaque page Web, chaque fichier en t&eacute;l&eacute;chargement via un lien ou un formulaire a-t-il des informations relatives \u00e0 son format?
Aw21-13061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-6-1
Aw21-13062=Dans chaque page Web, chaque fichier en t&eacute;l&eacute;chargement via un lien ou un formulaire a-t-il des informations relatives \u00e0 son poids?
Aw21-13062-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-6-2
Aw21-13063=Dans chaque page Web, chaque fichier en t&eacute;l&eacute;chargement via un lien ou un formulaire a-t-il, si n&eacute;cessaire, des informations relatives \u00e0 sa langue?
Aw21-13063-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-6-3
Aw21-13071=Dans chaque page Web, chaque fonctionnalit&eacute; de t&eacute;l&eacute;chargement d&#39;un document bureautique v&eacute;rifie-t-elle une de ces conditions (hors cas particuliers)?<ul><li> Le document en t&eacute;l&eacute;chargement est compatible avec l&#39;accessibilit&eacute;</li><li> Il existe une version alternative du document en t&eacute;l&eacute;chargement compatible avec l&#39;accessibilit&eacute;</li><li> Il existe une version alternative au format HTML du document en t&eacute;l&eacute;chargement</li></ul>
Aw21-13071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-7-1
Aw21-13081=Chaque document bureautique ayant une version accessible v&eacute;rifie-t-il une de ces conditions?<ul><li> La version compatible avec l&#39;accessibilit&eacute; offre la m&ecirc;me information</li><li> La version alternative au format HTML est pertinente et offre la m&ecirc;me information</li></ul>
Aw21-13081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-8-1
Aw21-13091=Dans chaque page Web, chaque expression inhabituelle ou limit&eacute;e, chaque expression idiomatique ou le jargon v&eacute;rifie-t-il une des conditions suivantes?<ul> <li> Il existe une d&eacute;finition via l&#39;&eacute;l&eacute;ment dfn</li><li> Il existe une d&eacute;finition via une liste de d&eacute;finition</li><li> Il existe une d&eacute;finition dans la page</li></ul>
Aw21-13091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-9-1
Aw21-13101=Dans chaque page Web, pour chaque expression inhabituelle ou limit&eacute;e, idiomatique ou de jargon ayant une d&eacute;finition, cette d&eacute;finition v&eacute;rifie-t-elle l\u2019une de ces conditions?<ul><li> Le contenu de l&#39;&eacute;l&eacute;ment dfn est pertinent</li><li> Le contenu de l&#39;&eacute;l&eacute;ment dd de la liste de d&eacute;finition est pertinent</li><li> La d&eacute;finition donn&eacute;e par le contexte adjacent est pertinente.</li></ul>
Aw21-13101-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-10-1
Aw21-13111=Dans chaque page Web, chaque contenu cryptique (art ascii, &eacute;moticon, syntaxe cryptique) v&eacute;rifie-t-il une de ces conditions?<ul><li> Un attribut title est disponible</li><li> Une d&eacute;finition est donn&eacute;e par le contexte adjacent</li></ul>
Aw21-13111-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-11-1
Aw21-13121= Dans chaque page Web, chaque contenu cryptique (art ascii, &eacute;moticon, syntaxe cryptique) v&eacute;rifie-t-il une de ces conditions?<ul><li> Le contenu de l&#39;attribut title est pertinent</li><li> La d&eacute;finition donn&eacute;e par le contexte adjacent est pertinente</li></ul>
Aw21-13121-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-12-1
Aw21-13131=Dans chaque page Web, chaque mot dont le sens ne peut &ecirc;tre compris sans en conna\u00eetre la prononciation, v&eacute;rifie-t-il une de ces conditions?<ul><li> L&#39;indication de la prononciation phon&eacute;tique est pr&eacute;sente de mani&egrave;re adjacente</li><li> L&#39;indication de la prononciation phon&eacute;tique est accessible via un lien</li></ul>
Aw21-13131-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-13-1
Aw21-13141=Dans chaque page Web, chaque texte qui n&eacute;cessite un niveau de lecture plus avanc&eacute; que le premier cycle de l&#39;enseignement secondaire (hors nom propre et titre) v&eacute;rifie-t-il une de ces conditions?<ul><li> Une illustration ou des symboles graphiques adapt&eacute;s au niveau de lecture requis sont pr&eacute;sents</li><li> Une version en langue des Signes Fran\u00e7aise est pr&eacute;sente</li><li> Une version vocalis&eacute;e du texte est pr&eacute;sente</li><li> Un r&eacute;sum&eacute; adapt&eacute; au niveau de lecture requis est pr&eacute;sent.</li></ul>
Aw21-13141-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-14-1
Aw21-13151=Dans chaque page Web, chaque image anim&eacute;e (balise img ou balise object) qui provoque un changement brusque de luminosit&eacute; ou un effet de flash v&eacute;rifie-t-elle une de ces conditions?<ul><li> La fr&eacute;quence de l&#39;effet est inf&eacute;rieure \u00e0 3 par seconde</li><li> La surface totale cumul&eacute;e des effets est inf&eacute;rieure ou &eacute;gale \u00e0 21 824 pixels</li></ul>
Aw21-13151-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-15-1
Aw21-13152=Dans chaque page Web, chaque script qui provoque un changement brusque de luminosit&eacute; ou un effet de flash v&eacute;rifie-t-il une de ces conditions?<ul><li> La fr&eacute;quence de l&#39;effet est inf&eacute;rieure \u00e0 3 par seconde</li><li> La surface totale cumul&eacute;e des effets est inf&eacute;rieure ou &eacute;gale \u00e0 21 824 pixels</li></ul>
Aw21-13152-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-15-2
Aw21-13153=Dans chaque page Web, chaque mise en forme CSS qui provoque un changement brusque de luminosit&eacute; ou un effet de flash v&eacute;rifie-t-elle une de ces conditions?<ul><li> La fr&eacute;quence de l&#39;effet est inf&eacute;rieure \u00e0 3 par seconde</li><li>La surface totale cumul&eacute;e des effets est inf&eacute;rieure ou &eacute;gale \u00e0 21 824 pixels</li></ul>
Aw21-13153-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-15-3
Aw21-13154=Dans chaque page Web, chaque applet java qui provoque un changement brusque de luminosit&eacute; ou un effet de flash v&eacute;rifie-t-elle une de ces conditions?<ul><li> La fr&eacute;quence de l&#39;effet est inf&eacute;rieure \u00e0 3 par seconde</li><li> La surface totale cumul&eacute;e des effets est inf&eacute;rieure ou &eacute;gale \u00e0 21 824 pixels</li></ul>
Aw21-13154-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-15-4
Aw21-13161=Dans chaque page Web, chaque changement brusque de luminosit&eacute; ou un effet de flash provoqu&eacute; par une image anim&eacute;e (balise img ou balise object) a-t-il une fr&eacute;quence inf&eacute;rieure ou &eacute;gale \u00e0 3 par seconde?
Aw21-13161-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-16-1
Aw21-13162=Dans chaque page Web chaque changement brusque de luminosit&eacute; ou un effet de flash provoqu&eacute; par un script a-t-il une fr&eacute;quence inf&eacute;rieure ou &eacute;gale \u00e0 3 par seconde?
Aw21-13162-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-16-2
Aw21-13163=Dans chaque page Web, chaque changement brusque de luminosit&eacute; ou un effet de flash provoqu&eacute; par une mise en forme CSS a-t-il une fr&eacute;quence inf&eacute;rieure ou &eacute;gale \u00e0 3 par seconde?
Aw21-13163-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-16-3
Aw21-13164=Dans chaque page Web, chaque changement brusque de luminosit&eacute; ou un effet de flash provoqu&eacute; par une applet java a-t-il une fr&eacute;quence inf&eacute;rieure ou &eacute;gale \u00e0 3 par seconde?
Aw21-13164-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-16-4
Aw21-13171= Dans chaque page Web, chaque contenu en mouvement, d&eacute;clench&eacute; automatiquement, v&eacute;rifie-t-il une de ces conditions?<ul><li> La dur&eacute;e du mouvement est inf&eacute;rieure ou &eacute;gale \u00e0 5 secondes</li><li> L&#39;utilisateur peut arr&ecirc;ter et relancer le mouvement</li><li> L&#39;utilisateur peut afficher et masquer le contenu en mouvement</li><li> L&#39;utilisateur peut afficher la totalit&eacute; de l&#39;information sans le mouvement.</li></ul>
Aw21-13171-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-17-1
Aw21-13172=Dans chaque page Web, chaque contenu clignotant, d&eacute;clench&eacute; automatiquement, v&eacute;rifie-t-il une de ces conditions?<ul><li> La dur&eacute;e du clignotement est inf&eacute;rieure ou &eacute;gale \u00e0 5 secondes</li><li> L&#39;utilisateur peut arr&ecirc;ter et relancer le clignotement</li><li> L&#39;utilisateur peut afficher et masquer le contenu clignotant</li><li> L&#39;utilisateur peut afficher la totalit&eacute; de l&#39;information sans le clignotement</li></ul>
Aw21-13172-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-13-17-2
Aw21-01014=Chaque image applet (balise applet) a-t-elle un attribut alt?
Aw21-01014-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-1-4
Aw21-01022=Pour chaque zone non cliquable (balise area avec l&#39;attribut nohref), non porteuse d&#39;information et ayant un attribut alt, le contenu de cet attribut est-il vide (alt="")?
Aw21-01022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-2-2
Aw21-01023=Pour chaque image applet (balise applet) non porteuse d&#39;information et ayant un attribut alt, le contenu de cet attribut est-il vide (alt="")?
Aw21-01023-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-2-3
Aw21-01024=Pour chaque image objet (balise object avec l&#39;attribut type="image/...") non porteuse d&#39;information, l&#39;alternative textuelle entre <object> et </object> est-elle vide?
Aw21-01024-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-2-4
Aw21-01025=Chaque image embarqu&eacute;e (balise embed avec l&#39;attribut type="image/...") non porteuse d&#39;information v&eacute;rifie-t-elle une de ces conditions?<ul><li>L&#39;&eacute;l&eacute;ment noembed est absent de la page</li><li>L&#39;&eacute;l&eacute;ment noembed ne contient aucune description de l&#39;image</li></ul>
Aw21-01025-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-2-5
Aw21-01032=Pour chaque zone (balise area) d&#39;une image r&eacute;active, porteuse d&#39;information et ayant un attribut alt, le contenu de cet attribut est-il pertinent (hors cas particuliers)?
Aw21-01032-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-2
Aw21-01033=Pour chaque bouton associ&eacute; \u00e0 une image (balise input avec l&#39;attribut type="image") ayant un attribut alt, le contenu de cet attribut est-il pertinent (hors cas particuliers)?
Aw21-01033-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-3
Aw21-01034=Pour chaque image applet (balise applet) porteuse d&#39;information et ayant un attribut alt, le contenu de cet attribut est-il pertinent (hors cas particuliers)?
Aw21-01034-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-4
Aw21-01035=Pour chaque image objet (balise object avec l&#39;attribut type="image/...") porteuse d&#39;information et ayant une alternative textuelle, l&#39;alternative textuelle entre &lt;object&gt; et &lt;/object&gt; est-elle pertinente (hors cas particuliers)?
Aw21-01035-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-5
Aw21-01036=Pour chaque image embarqu&eacute;e (balise embed avec l&#39;attribut type="image/...") porteuse d&#39;information et ayant une alternative textuelle, l&#39;alternative textuelle entre &lt;noembed&gt; et &lt;/noembed&gt; est-elle pertinente (hors cas particuliers)?
Aw21-01036-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-6
Aw21-01041=Pour chaque image (balise img) utilis&eacute;e comme CAPTCHA ou comme image-test, ayant un attribut alt, le contenu de cet attribut permet-il d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01041-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-1
Aw21-01042=Pour chaque zone (balise area) d&#39;une image r&eacute;active, utilis&eacute;e comme CAPTCHA ou comme image-test, et ayant un attribut alt, le contenu de cet attribut permet-il d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01042-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-2
Aw21-01043=Pour chaque image (balise applet) utilis&eacute;e comme CAPTCHA ou comme image-test, ayant un attribut alt, le contenu de cet attribut permet-il d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01043-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-3
Aw21-01044=Pour chaque bouton associ&eacute; \u00e0 une image (balise input avec l&#39;attribut type="image") utilis&eacute;e comme CAPTCHA ou comme image-test, ayant un attribut alt, le contenu de cet attribut permet-il d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01044-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-4
Aw21-01045=Pour chaque image objet (balise object avec l&#39;attribut type="image/...") utilis&eacute;e comme CAPTCHA ou comme image-test, et ayant une alternative textuelle, l&#39;alternative textuelle entre &lt;object&gt; et &lt;/object&gt; permet-elle d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01045-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-5
Aw21-01046=Pour chaque image embarqu&eacute;e (balise embed avec l&#39;attribut type="image/...") utilis&eacute;e comme CAPTCHA ou comme image-test et ayant une alternative textuelle, l&#39;alternative textuelle entre &lt;noembed&gt; et &lt;/noembed&gt; permet-elle d&#39;identifier la nature et la fonction de l&#39;image?
Aw21-01046-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-4-6
Aw21-01061=Chaque image porteuse d&#39;information (balise img) qui n&eacute;cessite une description d&eacute;taill&eacute;e, v&eacute;rifie-t-elle une de ces conditions?<ul><li> Il existe un attribut longdesc qui donne l&#39;adresse (url) d&#39;une page contenant la description d&eacute;taill&eacute;e</li><li> Il existe un attribut alt contenant la r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e adjacente \u00e0 l&#39;image</li><li> Il existe un lien adjacent (via une url ou une ancre) permettant d&#39;acc&eacute;der au contenu de la description d&eacute;taill&eacute;e</li></ul>
Aw21-01061-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-6-1
Aw21-01062=Chaque image object porteuse d&#39;information (balise object avec l&#39;attribut type="image/..."), qui n&eacute;cessite une description d&eacute;taill&eacute;e, v&eacute;rifie-t-elle une de ces conditions?<ul><li> Il existe entre &lt;object&gt; et &lt;/object&gt; une r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e pr&eacute;sente dans la page</li><li> Il existe un lien adjacent (via une url ou une ancre) permettant d&#39;acc&eacute;der au contenu de la description d&eacute;taill&eacute;e</li></ul>
Aw21-01062-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-6-2
Aw21-01063=Chaque image applet porteuse d&#39;information (balise applet), qui n&eacute;cessite une description d&eacute;taill&eacute;e, v&eacute;rifie-t-elle une de ces conditions? <ul><li> Il existe un attribut alt contenant la r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e adjacente \u00e0 l&#39;image</li><li> Il existe entre &lt;applet&gt; et &lt;/applet&gt; une r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e pr&eacute;sente dans la page</li><li> Il existe un lien adjacent (via une url ou une ancre) permettant d&#39;acc&eacute;der au contenu de la description d&eacute;taill&eacute;e</li></ul>
Aw21-01063-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-6-3
Aw21-01064=Chaque image embarqu&eacute;e porteuse d&#39;information (balise embed), qui n&eacute;cessite une description d&eacute;taill&eacute;e, v&eacute;rifie-t-elle une de ces conditions?<ul><li> Il existe entre &lt;noembed&gt; et &lt;/noembed&gt; une r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e pr&eacute;sente dans la page</li><li> Il existe un lien adjacent (via une url ou une ancre) permettant d&#39;acc&eacute;der au contenu de la description d&eacute;taill&eacute;e</li></ul>
Aw21-01064-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-6-4
Aw21-01065=Chaque bouton de formulaire de type image (balise input avec l&#39;attribut type="image", qui n&eacute;cessite une description d&eacute;taill&eacute;e, v&eacute;rifie-t-elle une de ces conditions?<ul><li> Il existe un attribut alt contenant la r&eacute;f&eacute;rence \u00e0 une description d&eacute;taill&eacute;e adjacente \u00e0 l&#39;image</li><li> Il existe un lien adjacent (via une url ou une ancre) permettant d&#39;acc&eacute;der au contenu de la description d&eacute;taill&eacute;e</li></ul>
Aw21-01065-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-6-5
Aw21-01071=Chaque image porteuse d&#39;information (balise img ou input de type image) ayant une description d&eacute;taill&eacute;e v&eacute;rifie-t-elle une de ces conditions?<ul><li> La description d&eacute;taill&eacute;e via l&#39;adresse r&eacute;f&eacute;renc&eacute;e dans l&#39;attribut longdesc est pertinente</li><li> La description d&eacute;taill&eacute;e dans la page et signal&eacute;e dans l&#39;attribut alt est pertinente</li><li> La description d&eacute;taill&eacute;e via un lien adjacent est pertinente</li></ul>
Aw21-01071-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-7-1
Aw21-01072=Chaque image objet (balise object avec l&#39;attribut type="image/...") ayant une description d&eacute;taill&eacute;e v&eacute;rifie-t-elle une des ces conditions?<ul><li> La description d&eacute;taill&eacute;e pr&eacute;sente dans la page et signal&eacute;e entre &lt;object&gt; et &lt;/object&gt;, est pertinente</li><li> La description d&eacute;taill&eacute;e via un lien adjacent est pertinente</li></ul>
Aw21-01072-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-7-2
Aw21-01073=Chaque image embarqu&eacute;e (balise embed avec l&#39;attribut type="image/...") ayant une description d&eacute;taill&eacute;e v&eacute;rifie-t-elle une de ces conditions?<ul><li> La description d&eacute;taill&eacute;e pr&eacute;sente dans la page et signal&eacute;e entre &lt;noembed&gt; et &lt;/noembed&gt; est pertinente</li><li> La description d&eacute;taill&eacute;e via un lien adjacent est pertinente</li></ul>
Aw21-01073-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-7-3
Aw21-01074=Chaque image applet (balise applet) ayant une description d&eacute;taill&eacute;e v&eacute;rifie-t-elle une de ces conditions?<ul><li> La description d&eacute;taill&eacute;e pr&eacute;sente dans la page et signal&eacute;e entre &lt;applet&gt; et &lt;/applet&gt; est pertinente</li><li> La description d&eacute;taill&eacute;e pr&eacute;sente dans la page et signal&eacute;e dans l&#39;attribut alt est pertinente</li><li> La description d&eacute;taill&eacute;e accessible via un lien adjacent est pertinente</li></ul>
Aw21-01074-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-7-4
Aw21-01091=Chaque image texte (balise img) doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01091-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-1
Aw21-01092=Pour chaque image r&eacute;active (balise img ou object avec l&#39;attribut usemap), chaque zone texte (balise area) doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01092-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-2
Aw21-01093=Pour chaque balise form, chacun de ses boutons "image texte" (balise input avec l&#39;attribut type="image") doit si possible &ecirc;tre remplac&eacute; par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01093-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-3
Aw21-01094=Chaque image texte applet (balise applet) doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01094-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-4
Aw21-01095=Chaque image texte objet (balise object avec l&#39;attribut type="image/...") doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01095-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-5
Aw21-01096=Chaque image texte embarqu&eacute;e (balise embed avec l&#39;attribut type="image/...") doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e?
Aw21-01096-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-9-6
Aw21-02021=Pour chaque cadre (balise frame) ayant un attribut title, le contenu de cet attribut est-il pertinent?
Aw21-02021-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-2-2-1
Aw21-02022=Pour chaque cadre (balise frame) ayant un attribut title, le contenu de cet attribut est-il pertinent?
Aw21-02022-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-2-2-2
Aw21-01037=Pour chaque image porteuse d&#39;information et ayant une alternative textuelle, l&#39;alternative textuelle est-elle courte et concise (hors cas particuliers)?
Aw21-01037-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-3-7
Aw21-01051= Chaque image (balises img, area, applet, object, embed) utilis&eacute;e comme CAPTCHA v&eacute;rifie-t-elle une de ces conditions?<ul><li>Il existe une autre forme de CAPTCHA non graphique, au moins</li><li>Il existe une autre solution d&#39;acc&egrave;s \u00e0 la fonctionnalit&eacute; s&eacute;curis&eacute;e par le CAPTCHA</li></ul>
Aw21-01051-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-5-1
Aw21-01052= Chaque bouton associ&eacute; \u00e0 une image (balise input avec l&#39;attribut type="image") utilis&eacute;e comme CAPTCHA v&eacute;rifie-t-il une de ces conditions?<ul><li>Il existe une autre forme de CAPTCHA non graphique, au moins </li><li>Il existe une autre solution d&#39;acc&egrave;s \u00e0 la fonctionnalit&eacute; s&eacute;curis&eacute;e par le CAPTCHA</li></ul>
Aw21-01052-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-5-2
Aw21-01081=Chaque image texte (balise img), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01081-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-1
Aw21-01082=Pour chaque image r&eacute;active (balise img ou object avec l&#39;attribut usemap), chaque zone texte (balise area), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01082-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-2
Aw21-01083=Pour chaque balise form, chacun de ses boutons "image texte" (balise input avec l&#39;attribut type="image"), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01083-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-3
Aw21-01084=Chaque image texte applet (balise applet), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01084-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-4
Aw21-01085=Chaque image texte objet (balise object avec l&#39;attribut type="image/..."), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01085-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-5
Aw21-01086=Chaque image texte embarqu&eacute;e (balise embed avec l&#39;attribut type="image/..."), en l&#39;absence d&#39;un m&eacute;canisme de remplacement, doit si possible &ecirc;tre remplac&eacute;e par du texte styl&eacute;. Cette r&egrave;gle est-elle respect&eacute;e Cette r&egrave;gle est-elle respect&eacute;e (hors cas particuliers)?
Aw21-01086-url=http://www.braillenet.org/accessibilite/referentiel-aw21-en/index.php#test-1-8-6