edit-contract.pageTitle=Modifier le contrat {0}
edit-contract.h1=Modifier le contrat {0}
edit-contract.contractLabel=<span class="mandatory">*</span> Intitul&eacute;
edit-contract.contractUrl=Url
edit-contract.contractBeginDate=<span class="mandatory">*</span> Date de d&eacute;but
edit-contract.contractBeginDateRule=format dd/MM/yyyy
edit-contract.contractEndDate=<span class="mandatory">*</span> Date de fin
edit-contract.contractEndDateRule=format dd/MM/yyyy
edit-contract.referentials=R&eacute;f&eacute;rentiels
edit-contract.functionalities=Types d&#39;audit
edit-contract.options=Options
edit-contract.ACT_LIMITATION=Nombre max d&#39;audits autoris&eacute;s 
edit-contract.MAX_DURATION=Dur&eacute;e max d&#39;un crawl pour les audits de site 
edit-contract.NB_OF_AUDIT_TO_DISPLAY=Nombre d&#39;audits historis&eacute;s \u00e0 afficher dans la page de contrat 
edit-contract.EXCLUSION_REGEXP=Expression r&eacute;guli&egrave;re d&#39;exclusion du crawl pour les audits de site 
edit-contract.DEPTH=Profondeur max du crawl pour les audits de site
edit-contract.MAX_DOCUMENTS=Nombre max de documents t&eacute;l&eacute;charg&eacute;s pour les audits de site :
edit-contract.saveChanges=Sauvegarder les modifications
edit-contract.emptyLabel=Veuillez saisir un intitul&eacute; de contrat
edit-contract.emptyBeginDate=Veuillez saisir une date de d&eacute;but pour le contrat
edit-contract.emptyEndDate=Veuillez saisir une date de fin pour le contrat
edit-contract.emptyUserList=Veuillez selectionner au moins un utilisateur
edit-contract.emptyRefList=Veuillez selectionner au moins un r&eacute;f&eacute;rentiel
edit-contract.endDateAnteriorToBeginDate=Veuillez saisir une date de fin qui ne soit pas ant&eacute;rieure \u00e0 la date de d&eacute;but
edit-contract.typeAuditCombinationIsNotAllowed=Veuillez changer la combinaison dans Type Audit
edit-contract.PAGES=Page
edit-contract.DOMAIN=Site
edit-contract.MANUAL=Manuel
edit-contract.UPLOAD=Fichier Hors ligne
edit-contract.SCENARIO=Scenario
edit-contract.crawlOptionsInfo=Ces options ne sont utilis&eacute;es que dans le cadre de l&#39;audit de site.
general-options=Options
crawl-options=Options du crawl
nb-max-audits-per-contract=Nombre max d&#39;audits autoris&eacute;s pour ce contrat.
nb-max-audits-per-contract-error=Veuillez saisir un nombre d&#39;audits par contrat correct
nb-max-audits-per-contract-rule=Vide signifie infini. Cette valeur concerne tous les types d&#39;audit.
nb-max-acts-per-contract=Nombre d&#39;audits historis&eacute;s \u00e0 afficher dans la page de contrat
nb-max-acts-per-contract-error=Veuillez saisir un nombre d&#39;audits historis&eacute;s \u00e0 afficher par contrat correct
nb-max-acts-per-contract-rule=Vide signifie infini. Cette valeur concerne tous les types d&#39;audit.
nb-max-pages-audits-per-contract=Nombre max d&#39;audits de pages autoris&eacute;s pour ce contrat.
nb-max-pages-audits-per-contract-error=Veuillez saisir un nombre d&#39;audits de pages par contrat correct
nb-max-pages-audits-per-contract-rule=Vide signifie infini. Cette valeur concerne seulement les d&#39;audits de pages.
nb-max-domain-audits-per-contract=Nombre max d&#39;audits de site autoris&eacute;s pour ce contrat.
nb-max-domain-audits-per-contract-error=Veuillez saisir un nombre d&#39;audits de site par contrat correct
nb-max-domain-audits-per-contract-rule=Vide signifie infini. Cette valeur concerne seulement les d&#39;audits de site.
nb-max-upload-audits-per-contract=Nombre max d&#39;audits de fichiers autoris&eacute;s pour ce contrat.
nb-max-upload-audits-per-contract-error=Veuillez saisir un nombre d&#39;audits de fichiers par contrat correct
nb-max-upload-audits-per-contract-rule=Vide signifie infini. Cette valeur concerne seulement les d&#39;audits de fichiers.
nb-max-scenario-audits-per-contract=Nombre max d&#39;audits de sc&eacute;nario autoris&eacute;s pour ce contrat.
nb-max-scenario-audits-per-contract-error=Veuillez saisir un nombre d&#39;audits de sc&eacute;nario par contrat correct
nb-max-scenario-audits-per-contract-rule=Vide signifie infini. Cette valeur concerne seulement les d&#39;audits de sc&eacute;nario.