#X-Generator: crowdin.com
NoError=Nada que decir, todo bien\!
AttributeMissing=Falta el atributo <code>{0}</code>\:
TagWithDeprecatedRepresentationAttributeFound=El atributo <code>{0}</code> es obsoleto\:
SuspectedNotPertinenttitleAttribute=El atributo <code>title</code>  de los siguientes enlaces puede ser no relevante\:
NotPertinenttitleAttribute=El atributo <code>title</code> de los siguientes enlaces no es relevante\:
SuspectedPertinenttitleAttribute=El atributo <code>title</code>  de los siguientes enlaces puede no ser relevante \:
UnexplicitLinkOutOfContext=El enlace {0} no es explicito fuera de contexto\:
HeaderTagNotHierarchicallyWelldefined=Las etiquetas de encabezado no est\u00e1n jer\u00e1rquicamente bien definidas\:
DeprecatedRepresentationTagFound=La etiqueta <code>{0}</code> es obsoleta\:
PresentationTagFound=Se ha encontrado la siguiente etiqueta de presentaci\u00f3n<code>{0}</code>\:
PresentationAttrFound=Se ha encontrado el atributo de presentaci\u00f3n <code>{0}</code>\:
BadUnitType=El uso de unidades {0} no est\u00e1 permitido\:
ContentCssPropertyDetected=La propiedad CSS <code>contenido</code> ha sido encontrada en los siguientes selectores CSS, por favor verifica que su contenido no maneje informaci\u00f3n\: 
SuspectedUnexplicitContext=El v\u00ednculo {0} parece no ser expl\u00edcito, compruebe el contexto\:
SuspectedIdenticalLinkWithDifferentTarget=Los siguientes textos de enlaces parecen ser id\u00e9nticos  pero con objetivos diferentes\:
IdenticalLinkWithDifferentTarget=Los siguientes enlaces son id\u00e9nticos pero con objetivos diferentes\:
H1TagMissing=Falta la etiqueta <code>h1</code>.
TitleTagMissing=Falta la etiqueta <code>title</code>
UnTestedResource=El recurso {0} ha sido probado
ValueEmpty=El elemento {0} est\u00e1 vac\u00edo
FrameTagDetected=La p\u00e1gina contiene etiquetas <code>frame</code>
IframeTagDetected=La p\u00e1gina contiene etiquetas <code>iframe</code>
FlashContentDetected=La p\u00e1gina contiene contenido flash
SuspectedFlashContentDetected=La p\u00e1gina puede incluir flash
SuspectedNotWellFormattedUnordererdList=La siguiente informaci\u00f3n parece ser una lista sin numerar pero no se usan las etiquetas <code>ul</code> y <code>li</code>\:
SuspectedNotWellFormattedOrdererdList=La siguiente informaci\u00f3n parece ser una lista numerada pero no se usan las etiquetas <code>ul</code> y <code>li</code> \:
NotPertinentAltAttributeWithSuspectedInformativeImage=Las siguientes im\u00e1genes parecen ser informativas y no tienen un atributo <code>alt</code> relevante\:
NotPertinentAltAttribute=Las siguientes im\u00e1genes tienen un atributo <code>alt</code> no relevante \:
NotPertinentAltAttributeButSuspectedDecorativeImage=Las siguientes im\u00e1genes parecen ser decorativas y no tienen un atributo <code>alt</code> relevante \:
WrongDoctypeDeclaration=La declaraci\u00f3n doctype no se encuentra entre la lista de declaraciones Doctype recomendados por el W3C.
DoctypeMissing=Falta la declaraci\u00f3n doctype.
InvalidFormField=El siguiente <code>{0}</code> campo del formulario no contiene un atributo <code>title</code> ni etiqueta<code>label</code>\:
TitleTagNotRevelevant=El t\u00edtulo de p\u00e1gina  {0} no es relevante
UnexplicitContext=El contexto del v\u00ednculo {0} no es expl\u00edcito\:
TitleNotUnique=La etiqueta <code>title</code> no es \u00fanica en el sitio para las siguientes p\u00e1ginas\:
TitleIdenticalTo=La etiqueta <code>t\u00edtulo</code> de la p\u00e1gina tambi\u00e9n se ha encontrado en las p\u00e1ginas siguientes\:
TdWithHeadersDetected=La p\u00e1gina contiene una celda de tabla vinculada a un encabezado  (<code>&lt;td header\="..."&gt;</code>)
TableTagDetected=La p\u00e1gina contiene al menos una tabla
OptgroupWithoutLabel=Las siguientes etiquetas <code>optgroup</code> no tienen ning\u00fan atributo <code>label</code>\:
FieldsetWithoutLegend=Las siguientes etiquetas <code>fieldset</code> no tienen ning\u00fan nodo secundario de <code>leyenda</code>\:
ForMissing=El atributo <code>for</code> falta en los siguientes elementos\:
IdMissing=El atributo <code>id</code> falta en los siguientes elementos \:
IdNotUnique=El valor {0} del atributo <code>id</code> ha sido encontrada en los siguientes elementos\:
ContextChangedScriptDetected=Los siguientes scripts parecen iniciar un cambio de contexto sin avisar al usuario\:
TitleAttributeEmpty=El atributo <code>title</code> est\u00e1 vac\u00edo en los siguientes elementos\:
MetaDescriptionTagMissing=Falta la descripci\u00f3n meta.
MoreThanOneMetaDescriptionTag=La p\u00e1gina contiene m\u00e1s de una descripci\u00f3n meta.
EmptyMetaDescriptionTag=La descripci\u00f3n meta "{0}" no es relevante\: 
MetaDescriptionNotUnique=La meta descripci\u00f3n no es \u00fanica en el sitio para las siguientes p\u00e1ginas\:
MetaDescriptionIdenticalTo=La siguiente meta descripci\u00f3n  tambi\u00e9n se ha encontrado en las siguientes p\u00e1ginas\:
UrlLengthExceedLimit=La URL supera los 255 caracteres.
SourceCodeNotUnique=El c\u00f3digo fuente no es \u00fanico en el sitio para las siguientes p\u00e1ginas\:
SourceCodeIdenticalTo=El c\u00f3digo fuente es id\u00e9ntico al de las siguientes p\u00e1ginas\:
TitleTagLengthExceedLimit=La etiqueta <code>title</code> supera los 70 caracteres.
MoreThanOneTitleTag=La p\u00e1gina contiene m\u00e1s de una etiqueta <code>title</code>.
MoreThanOneH1Tag=La p\u00e1gina contiene m\u00e1s de una etiqueta <code>h1</code>.
IdenticalH1AndTitleTags=La etiqueta de <code>title</code> y la etiqueta <code>h1</code> son id\u00e9nticos en la p\u00e1gina.
H1NotUnique=La etiqueta <code>h1</code> no es \u00fanica en el sitio para las siguientes p\u00e1ginas \:
H1IdenticalTo=La etiqueta <code>h1</code> de la p\u00e1gina tambi\u00e9n se ha encontrado en las p\u00e1ginas siguientes\:
LangAttributeMissingOnHtml=Falta la especificaci\u00f3n del lenguaje en el nodo HTML.
IrrelevantLanguageDeclaration=La especificaci\u00f3n del lenguaje es irrelevante en los siguientes nodos\:
SuspectedIrrelevantLanguageDeclaration=La especificaci\u00f3n del lenguaje parece ser irrelevante en los siguientes nodos\:
SuspectedRelevantLanguageDeclaration=La especificaci\u00f3n del lenguaje parece ser relevante en los siguientes nodos\:
WrongLanguageDeclaration=La especificaci\u00f3n del lenguaje no es v\u00e1lida.
LangAttributeMissingOnWholePage=Falta la especificaci\u00f3n del lenguaje en la p\u00e1gina.
UndetectedLanguage=No puede ser detectado el lenguaje.
MalformedLanguage=La especificaci\u00f3n del lenguaje es incorrecta.
CaptionMissing=Falta la etiqueta <code>caption</code> en las siguientes tablas de datos\:
CaptionMissingCheckDataTable=Falta la etiqueta de <code>caption</code> en las siguientes tablas, por favor verifica que no es una tabla de datos\:
CaptionPresentCheckDataTable=La etiqueta <code>caption</code> ha sido encontrada en las siguientes tablas, por favor compruebe en realidad son tablas de datos\:
SummaryMissing=Falta el atributo <code>summary</code> en las siguientes tablas de datos\:
SummaryMissingCheckDataTable=Falta el atributo <code>summary</code> en las siguientes tablas, por favor verifica que no son tablas de datos\:
SummaryPresentCheckDataTable=El atributo <code>summary</code> se ha encontrado en las siguientes tablas, por favor verifica que en realidad son tablas de datos\:
NotImmediateRedirectionViaMeta=La redirecci\u00f3n realizada a trav\u00e9s de la etiqueta meta no es inmediata
ManualCheckOnElements=Por favor verifica los elementos <code>{0}</code> detectados\:
RobotsTxtMissing=El archivo robots.txt est\u00e1 ausente o es vac\u00edo.
SitemapMissing=El archivo sitemap.xml est\u00e1 ausente o es vac\u00edo.
checkRelevancyTitleTag=Comprueba la relevancia de la etiqueta de <code>title</code> "{0}"\: 
notRelevantTitleTag=La etiqueta de <code>title</code> "{0}" no es relevante\: 
CheckRelevancyMetaDescriptionTag=Verifica la relevancia de la meta description "{0}"\:
NotPertinentMetaDescription=La descripci\u00f3n meta "{0}" no es relevante\:
MetaDescriptionTagLengthExceedLimit=La descripci\u00f3n meta supera los 255 caracteres.
################################
###Accessiweb 2.2 and Rgaa2.2###
################################
TitleAttributeMissing=Falta el atributo de <code>title</code> en los siguientes elementos\: 
BadDoctypeLocation=La declaraci\u00f3n doctype se encuentra luego de la etiqueta <code>html</code> o fue declarada varias veces.
InvalidDoctypeDeclaration=La declaraci\u00f3n doctype no se encuentra entre la lista de declaraciones Doctype recomendados por el W3C.
AltMissing=Falta el atributo de <code>alt</code> en los siguientes elementos \:
NotPertinentAlt=Las siguientes im\u00e1genes que transmiten informaci\u00f3n tienen un atributo <code>alt</code> no relevante\:
DecorativeElementWithNotEmptyAltAttribute=Las siguientes im\u00e1genes decorativas tienen un atributo <code>alt</code> no vac\u00edo\:
CheckAlternativeOfDecorativeElement=Verifique que la alternativa de las siguientes im\u00e1genes decorativas est\u00e1 vac\u00eda\:
CheckNatureAndAlternativeOfElement=Si las siguientes im\u00e1genes son decorativas, por favor verifica que la alternativa est\u00e1 vac\u00eda\:
CheckNatureOfElementWithNotEmptyAltAttribute=Las siguientes im\u00e1genes tienen un atributo <code>alt</code> vac\u00edo, por favor verifica que son decorativas\:
CheckNatureOfElementWithEmptyAltAttribute=Las siguientes im\u00e1genes tienen un atributo <code>alt</code> vac\u00edo, por favor verifica que son decorativas\:
CheckPertinenceOfAltAttributeOfInformativeImage=Por favor revise la pertinencia del valor del atributo <code>alt</code> de las im\u00e1genes siguientes que transmite informaci\u00f3n\:
CheckNatureOfImageWithNotPertinentAlt=Las siguientes im\u00e1genes tienen un valor en el atributo <code>alt/<code> no pertinente, por favor revisa que transmitan informaci\u00f3n\:
CheckNatureOfImageAndAltPertinence=Si las siguientes im\u00e1genes transmiten informaci\u00f3n, por favor revisa la pertinencia del valor de su atributo <code>alt</code>\: 
CheckCaptchaAlternative=Por favor revisa que la alternativa permite identificar las siguientes im\u00e1genes CAPTCHA\: 
CheckCaptchaAlternativeAccess=Por favor revisa que se proporciona una alternativa para las siguientes im\u00e1genes CAPTCHA\: 
CheckNatureOfImageAndLongdescDefinition=Si las siguientes im\u00e1genes transmiten informaci\u00f3n, comprueba por favor que se proporciona una descripci\u00f3n detallada si es necesario\: 
CheckLongdescDefinitionOfInformativeImage=Comprueba por favor que se proporciona una descripci\u00f3n detallada, si es necesario, para las siguientes im\u00e1genes que transmiten informaci\u00f3n\: 
CheckDescriptionPertinenceOfInformativeImage=Se han detectado las siguientes im\u00e1genes que transmiten informaci\u00f3n, por favor revisa la pertinencia de la descripci\u00f3n extensa\: 
CheckDescriptionPresenceOfInformativeImage=Se han detectado las siguientes im\u00e1genes que transmiten informaci\u00f3n, por favor revisa la pertinencia de la descripci\u00f3n extensa \: 
CheckNatureOfImageAndDescriptionPertinence=Se han detectado las siguientes im\u00e1genes, por favor, revisa su naturaleza y la pertinencia de la descripci\u00f3n extensa\: 
CheckNatureOfImageAndDescriptionPresence=Se han detectado las siguientes im\u00e1genes, por favor, revisa su naturaleza y la presencia de una descripci\u00f3n extensa 
NotPertinentTitleOfFrame=El atributo <code>title</code> de las siguientes etiquetas <code>frame</code> no es pertinente\: 
NotPertinentTitleOfIframe=El atributo <code>title</code> de las siguientes etiquetas <code>frame</code> no es pertinente\: 
CheckTitleOfFramePertinence=Por favor revisa la pertinencia del atributo <code>title</code> de las siguientes etiquetas <code>frame</code>\:
CheckTitleOfIframePertinence=Por favor revisa la pertinencia del atributo <code>title</code> de las siguientes etiquetas <code>frame</code> \:
NotPertinentLegend=Las siguientes etiquetas <code>legend</code> no son pertinentes\: 
CheckLegendPertinence=Por favor revisa la pertinencia de las siguientes etiquetas <code>legend</code>\: 
CheckSelectUsage=Por favor revisa que las siguientes etiquetas <code>select</code> no necesiten utilizar la etiqueta <code>optgroup</code> para agrupar las etiquetas <code>option</code>
CheckLabelPertinence=Por favor revisa la pertinencia de las siguientes etiquetas <code>label</code> \: 
FormElementWithoutLabel=Los siguientes elementos de formulario no tienen ninguna etiqueta\: 
CheckTitleOfFormElement=Por favor comprueba el atributo <code>title</code> de los siguientes elementos de formulario para determinar si transmiten su funci\u00f3n\: 
NotPertinentOptgroupLabel=El atributo <code>label</code> de las siguientes etiquetas <code>optgroup</code> no es pertinente\: 
CheckOptgroupLabelPertinence=Por favor revisa la pertinencia del atributo <code>label</code> de las siguientes etiquetas <code>optgroup</code>\:
FormElementWithoutIdentifier=Los siguientes elementos de formulario no tienen ning\u00fan identificador\: 
InvalidLabel=Los siguientes {0} campos de formulario no contienen ni el atributo <code>title</code> ni la etiqueta <code>label</code>\:
CheckNatureOfTableWithEmptySummaryAttribute=El atributo <code>summary</code> est\u00e1 vac\u00edo en las tablas siguientes, por favor compruebe en realidad son tablas usadas para presentaci\u00f3n\:
CheckNatureOfTableWithNotEmptySummaryAttribute=El atributo <code>summary</code> no est\u00e1 vac\u00edo en las siguientes tablas, por favor verifica que en realidad son tablas de datos \:
CheckNatureOfTableWithSummaryAttribute=El atributo <code>summary</code> se ha encontrado en las siguientes tablas, por favor verifica que en realidad son tablas de datos \:
CheckNatureOfTableWithoutSummaryAttribute=Falta el atributo <code>summary</code> en las siguientes tablas, por favor verifica que no son tablas de datos \:
CheckNatureOfTableWithoutCaptionChildElement=Falta la etiqueta de <code>caption</code> en las siguientes tablas, por favor verifica que no es una tabla de datos \:
CheckNatureOfTableWithCaptionChildElement=La etiqueta <code>caption</code> ha sido encontrada en las siguientes tablas, por favor compruebe en realidad son tablas de datos \:
NotEmptySummaryForPresentationTable=Las siguientes tablas de presentaci\u00f3n no tienen un atributo <code>summary</code> vacio\:
NotPertinentSummaryForDataTable=El atributo <code>summary</code> no es pertinente para las siguientes tablas de datos\:
NotPertinentCaptionForDataTable=La etiqueta <code>caption</code> child no es pertinente para las tablas de datos siguientes\:
CheckSummaryPertinenceForDataTable=Por favor revise la pertinencia del atributo <code>summary</code> para las tablas de datos siguientes\:
CheckCaptionPertinenceForDataTable=Por favor revise la pertinencia de la etiqueta child <code>caption</code> para las tablas de datos siguientes\:
CheckNatureOfTableForNotPertinentSummary=El atributo <code>summary</code> no es pertinente para las tablas siguientes, por favor compruebe que es en realidad tablas de datos\:
CheckNatureOfTableForNotPertinentCaption=La etiqueta child <code>title</code> no es pertinente para las tablas siguientes, por favor compruebe es en realidad las tablas de datos\:
CheckNatureOfTableAndSummaryPertinence=Si las tablas siguientes son tablas de datos, por favor consulte la pertinencia de su atributo <code>summary</code>\: 
CheckNatureOfTableAndCaptionPertinence=Si las siguientes tablas son las tablas de datos, por favor consulte la pertinencia de su etiqueta child <code>caption</code>\: 
CheckLinearisedContent=Compruebe que el contenido linealizado es todav\u00eda comprensible para las siguientes tablas de presentaci\u00f3n\: 
CheckNatureOfTableAndLinearisedContent=Si las siguientes tablas son tablas de presentaci\u00f3n, por favor consulte que el contenido linealizado es todav\u00eda comprensible\: 
CheckUsageOfHeaderForDataTable=Consulte que las siguientes tablas de datos definen encabezados con etiquetas <code>th</code>\:
CheckNatureOfTableAndUsageOfHeaders=Si las siguientes tablas son tablas de datos, por favor compruebe que definen encabezados con etiquetas <code>th</code>\:
CheckDefinitionOfHeaderForDataTable=Compruebe si las celdas de las siguientes tablas de datos se asocian correctamente con los encabezados\:
CheckNatureOfTableAndHeadersDefinition=Si las tablas siguientes son las tablas de datos, consulte que sus celdas se asocian correctamente con los encabezados\:
PresentationTableWithForbiddenMarkup=Las siguientes tablas de presentaci\u00f3n contienen marcado prohibido\: 
CheckTableIsDataTable=Por favor consulte que las siguientes tablas son tablas de datos\: 
CheckTableIsPresentationTable=Por favor consulte que las siguientes tablas son tablas de presentaci\u00f3n\: 
EmptyLink=Los siguientes enlaces est\u00e1n vac\u00edos\:
NoPatternDetected=Ning\u00fan patr\u00f3n sospechoso ha sido detectado, por favor revise manualmente.
DetectedTag=Se ha encontrado la etiqueta {0}
CheckTitlePertinence=Comprobar la pertinencia de la siguiente etiqueta de <code>title</code>\: 
BadContrast=El siguiente <code>{0}</code> tiene un mal contraste\: 
BadContrastHiddenElement=El siguiente <code>{0}</code> tiene un mal contraste pero est\u00e1n ocultos\:
BadContrastButAlternativeContrastMechanismOnPage=La p\u00e1gina contiene un mecanismo que permite al usuario mostrar texto con una proporci\u00f3n de contraste correcto.  El siguiente <code>{0}</code> tiene un mal contraste pero se devuelven s\u00f3lo como informaci\u00f3n adicional\: 
NotTreatedBackgroundColor=Las etiquetas definidas con el valor de fondo <code>{0}</code> podr\u00edan no haber sido probadas.
CheckTheContrastOfImagesWithText=No se han encontrado problemas de contraste en los elementos textuales de la p\u00e1gina, por favor verifique manualmente el contraste de im\u00e1genes con texto.
LangChangeMissingOnElementOrOneOfItsParent=No se especifica el cambio de idioma para las etiquetas siguientes\: 
CheckManuallyShortText=Comprobar manualmente textos con menos de 20 palabras.
UnexplicitLinkWithContext=El texto de los siguientes enlaces no es lo suficiente expl\u00edcito para comprender el prop\u00f3sito del enlace, por favor, compruebe el contexto del texto de los siguientes enlaces\: 
CheckLinkWithContextPertinence=Comprobar la pertinencia del texto y el contexto de los siguientes enlaces\:
CheckLinkWithoutContextPertinence=Comprobar la pertinencia del texto de los siguientes enlaces que no tienen ning\u00fan contexto\:
CheckLinkPertinence=Comprobar la pertinencia del texto de los siguientes enlaces\:
CheckButtonTitlePertinence=Comprobar la pertinencia del texto de los botones siguientes\:
CheckButtonWithSameTextLeadToSameAction=Compruebe que los botones de la p\u00e1gina con un texto id\u00e9ntico conducen a la misma acci\u00f3n\: 
UnexplicitLink=El texto de los siguientes enlaces no es lo suficientemente expl\u00edcito para entender el prop\u00f3sito y objetivo del enlace\: 
NotPertinentLinkTitle=El atributo <code>title</code> de los siguientes enlaces no es relevante \: 
SuspectedNotPertinentLinkTitle=El atributo <code>title</code>  de los siguientes enlaces puede ser potencialmente no relevante \:
SuspectedPertinentLinkTitle=El atributo de <code>title</code> de los siguientes enlaces es potencialmente relevante\:
EmptyLinkTitle=Los siguientes enlaces tienen un atributo <code>title</code>vac\u00edo \:
LinkWithoutTarget=Se han detectado las siguientes etiquetas utilizadas para el dise\u00f1o\:  etiqueta <code>a</code> sin atributo <code>href</code>
FieldsetNotWithinForm=Se han detectado las siguientes etiquetas utilizadas para el dise\u00f1o\: etiqueta <code>fieldset</code> sin <code>form</code> ascendente
OfficeDocumentDetected=Por favor, compruebe que los documentos de office se\u00f1alados por los siguientes enlaces tienen una versi\u00f3n accesible\: 
FileToDownloadDetectedCheckFormat=Por favor verifique que los documentos descargables se\u00f1alados por los siguientes enlaces proporcionan informaci\u00f3n acerca de su formato\:
FileToDownloadDetectedCheckWeight=Por favor verifique que los documentos descargables se\u00f1alados por los siguientes enlaces proporcionan informaci\u00f3n acerca de su peso\:
FileToDownloadDetectedCheckLang=Por favor, compruebe que los documentos descargables se\u00f1alados por los siguientes enlaces proporcionan informaci\u00f3n sobre su idioma\:
CheckManuallyLinkWithoutExtension=Ning\u00fan patr\u00f3n sospechoso detectado. Comprobar si algunos de los enlaces sin extensi\u00f3n conducen a un documento descargable.
CheckDownloadableDocumentFromForm=Ning\u00fan patr\u00f3n sospechoso detectado. Comprobar si algunas de los formas da lugar a un documento descargable.
CheckUserIsWarnedWhenNewWindowOpen=Los siguientes enlaces abren una nueva ventana, verifique que se advierta al usuario\: 
CheckUserIsWarnedInCaseOfNewWindow=Compruebe si se advierte el usuario, si una de las siguientes etiquetas <code>{0}</code> solicitar\u00e1 abrir en una nueva ventana\: 
CheckJavaScriptPromptANewWindow=Compruebe si se advierte al usuario si un comando javascript solicitar\u00e1 abrir en una nueva ventana\: 
NotPertinentTitle=La siguiente etiqueta <code>title</code> no es pertinente\:  
NotPertinentHeading=Los siguientes t\u00edtulos (etiquetas <code>h</code>) no son pertinentes\: 
CheckHeadingPertinence=Comprobar la pertinencia de los siguientes encabezamientos (etiquetas <code>h</code>)\: 
HiddenTextDetected=Revise que los siguientes textos ocultos no est\u00e1n destinados a ser interpretados o se muestran a trav\u00e9s de una acci\u00f3n del usuario\: 
InvisibleOutlineOnFocus=Las siguientes etiquetas <code>{0}</code> tienen un contorno de ninguno o "0", o el color es id\u00e9ntico al color de fondo y lo hace invisible. Compruebe por favor que el mecanismo de contorno no es redefinido por CSS\:
CheckManuallyOutlineForFormElementAndIframe=Verifique que el foco est\u00e1 visible para las etiquetas de tipo <code>select</code>, <code>input</code>, <code>textarea</code>, <code>button</code> y <code>iframe</code>.
DataTableWithoutHeader=Las siguientes tablas de datos utilizan la etiqueta <code>th</code> para definir encabezados\: 
HeaderDetectedCheckAllHeadersAreWellFormed=Las siguientes tablas de datos tienen al menos una etiqueta <code>th</code>, compruebe que cada encabezado est\u00e1 bien definido con una etiqueta de <code>th</code>\: 
AlternativeTooLong=Las siguientes etiquetas <code>{0}</code> proporcionan una alternativa que supera los 120 caracteres\: 
UrlParametersDetected=La direcci\u00f3n URL de la p\u00e1gina contiene par\u00e1metros, deben aplicarse las reglas de reescritura.
UrlPathUnderscoreDetected=Palabras en la URL est\u00e1n separadas por caracteres de subrayado <code>_</code>, que deben ser reemplazados por guiones <code>\u2013</code> (separador reconocido por los motores de b\u00fasqueda).