NoError = Rien a dire, tout est parfait ici !!
AttributeMissing=L&apos;attribut <strong> {0} </strong> est absent sur les \u00e9l\u00e9ments suivants :
TagWithDeprecatedRepresentationAttributeFound=L&apos;attribut <strong> {0} </strong> est depr\u00e9ci\u00e9 :
SuspectedNotPertinenttitleAttribute = L&apos;attribut title des liens suivants est suspect\u00e9 invalide :
NotPertinenttitleAttribute = L&apos;attribut title des liens suivants n&apos;est pas pertinent : 
SuspectedPertinenttitleAttribute = L&apos;attribut title des liens suivants est suspect\u00e9 valide :
UnexplicitLinkOutOfContext = Le lien <strong> {0} </strong> n&apos;est pas explicite hors contexte :
HeaderTagNotHierarchicallyWelldefined = Les balises <strong> {0} </strong> suivantes ont une mauvaise structure hierarchique :
DeprecatedRepresentationTagFound = La balise <strong> {0} </strong> est depreci\u00e9e  :
BadUnitType = L&apos;unit\u00e9 <strong> {0} </strong> ne doit pas \u00eatre utilis\u00e9e :
SuspectedUnexplicitContext = Le lien <strong> {0} </strong> n&apos;est potentiellement pas explicite, v\u00e9rifier le contexte :
SuspectedIdenticalLinkWithDifferentTarget = Les liens suivants semblent \u00eatre identiques et ne pas pointer vers la meme cible :
IdenticalLinkWithDifferentTarget = Les liens suivants sont identiques et ne pointent pas vers la meme cible :
H1TagMissing = La balise &lt;H1&gt; est absente
TitleTagMissing = La balise &lt;Title&gt; est absente
UnTestedResource = La ressource <strong> {0} </strong> n&apos;a pas pu \u00eatre test\u00e9e
ValueEmpty = L&apos; \u00e9l\u00e9ment <strong> {0} </strong> est vide
FrameTagDetected = La page contient des frames
IframeTagDetected = La page contient des iframes
FlashContentDetected = La page contient du contenu flash
SuspectedFlashContentDetected = La page contient peut-\u00eatre du contenu flash
SuspectedNotWellFormattedUnordererdList= Les informations suivantes semblent \u00eatre des listes non ordonn\u00e9es mais n&apos;utilisent pas les balises ul et li :
SuspectedNotWellFormattedOrdererdList= Les informations suivantes semblent \u00eatre des listes ordonn\u00e9es mais n&apos;utilisent pas les balises ol et li :
NotPertinentAltAttributeWithSuspectedInformativeImage = La valeur <strong> {0} </strong> de l&apos;attribut "alt" des images suspect\u00e9es informatives suivantes n&apos;est pas pertinente:
NotPertinentAltAttribute=La valeur <strong> {0} </strong> de l&apos;attribut "alt" des images suivantes n&apos;est pas pertinent:
NotPertinentAltAttributeButSuspectedDecorativeImage=La valeur <strong> {0} </strong> de l&apos;attribut "alt" des images suspect\u00e9es decoratives suivantes n&apos;est pas pertinente :
WrongDoctypeDeclaration=Le doctype ne figure pas parmi la liste des doctypes recommand\u00e9s par la W3C.
DoctypeMissing=La page ne contient pas de doctype.
InvalidFormField=Les champs de formulaire <strong> {0} </strong> suivants ne contiennent ni attribut title, ni \u00e9tiquette :
TitleTagNotRevelevant=Le titre de la page <strong> {0} </strong> n&apos;est pas pertinent.
UnexplicitContext=Le contexte du lien <strong> {0} </strong> n&apos;est pas explicite :
TitleNotUnique=Le titre <strong> {0} </strong> a \u00e9t\u00e9 trouv\u00e9 sur les pages suivantes :
TdWithHeadersDetected=La page contient un cellule de tableau li\u00e9e \u00e0 une ent\u00eate (<strong>&lt;td header="..."&gt;</strong>)
TableTagDetected=The page constains a least one table
OptgroupWithoutLabel=Les balises &lt;optgroup&gt; suivantes n&apos;ont pas d&apos;attribut label :
FieldsetWithoutLegend=Les balises &lt;fieldset&gt; suivantes n&apos;ont pas de balises filles de type &lt;legend&gt; :
ForMissing=L&apos;attribut "for" est manquant sur les \u00e9l\u00e9ments suivants :
IdMissing=L&apos;attribut "id" est manquant sur les \u00e9l\u00e9ments suivants :
IdNotUnique=L&apos;"id" <strong> {0} </strong> a \u00e9t\u00e9 trouv\u00e9 sur les \u00e9l\u00e9ments suivants :
ContextChangedScriptDetected=Les scripts suivants semblent initier un changement de contexte sans avertir l&apos;utilisateur :
TitleAttributeEmpty = L&apos;attribut title est vide pour les \u00e9l\u00e9ments suivants :
MetaDescriptionTagMissing = La meta description est absente.
MoreThanOneMetaDescriptionTag = La page contient plus d&apos;une meta description.
EmptyMetaDescriptionTag = La page contient une meta description non pertinente.
MetaDescriptionNotUnique = La meta description suivante "<strong> {0} </strong>" n&apos;est pas unique :
MetaDescriptionIdenticalTo = La meta description suivante "<strong> {0} </strong>" est aussi pr\u00e9sente sur les pages suivantes :
UrlLengthExceedLimit = L&apos;URL de cette page d\u00e9passe les 255 caract\u00e8res.
SourceCodeNotUnique = Le code source des pages suivantes n&apos;est pas unique \u00e0 l&apos;\u00e9chelle du site :
SourceCodeIdenticalTo = Le code source est identique \u00e0 celui des pages suivantes :
TitleTagLengthExceedLimit = La balise Title d\u00e9passe les 70 caract\u00e8res.
MoreThanOneTitleTag = La page contient plus d&apos;une balise title.
TitleNotUnique = La balise title suivante "<strong> {0} </strong>" n&apos;est pas unique :
TitleIdenticalTo = La balise title suivante "<strong> {0} </strong>" est aussi pr\u00e9sente sur les pages suivantes :
H1TagMissing = La balise H1 est absente.
MoreThanOneH1Tag = La page contient plus d&apos;une balise H1.
IdenticalH1AndTitleTags = Les balises title et H1 sont identiques sur la page :
H1NotUnique = La balise H1 suivante "<strong> {0} </strong>" n&apos;est pas unique :
H1IdenticalTo = La balise H1 suivante "<strong> {0} </strong>" est aussi pr\u00e9sente sur les pages suivantes :
LangAttributeMissingOnHtml=L&apos;indication de langue est absente pour l&apos;\u00e9l\u00e9ment HTML.
IrrelevantLanguageDeclaration=L&apos;indication de langue n&apos;est pas pertinente pour les \u00e9l\u00e9ments suivants :
SuspectedIrrelevantLanguageDeclaration=L&apos;indication de langue ne semble pas pertinente pour les \u00e9l\u00e9ments suivants :
SuspectedRelevantLanguageDeclaration=L&apos;indication de langue semble pertinente pour les \u00e9l\u00e9ments suivants :
WrongLanguageDeclaration=L&apos;indication de langue est invalide.
LangAttributeMissingOnWholePage=Aucune indication de langue n&apos;a \u00e9t\u00e9 trouv\u00e9e sur la page.
UndetectedLanguage=La langue n&apos;a pas pu \u00eatre d\u00e9tect\u00e9e pour les \u00e9l\u00e9ments suivants :
MalformedLanguage=L&apos;indication de langue est mal form\u00e9e.
CaptionMissing=La balise caption est manquante sur les tableaux de donn\u00e9es suivants :
CaptionMissingCheckDataTable=La balise caption est manquante sur les tableaux suivants, v\u00e9rifier qu&apos;il ne s&apos;agit pas de tableaux de donn\u00e9es :
CaptionPresentCheckDataTable=La balise caption est pr\u00e9sente sur les tableaux suivants, v\u00e9rifier qu&apos;il s&apos;agit bien de tableaux de donn\u00e9es :
SummaryMissing=L&apos;attribute summary est manquant sur les tableaux de donn\u00e9es suivants :
SummaryMissingCheckDataTable=L&apos;attribute summary est manquant sur les tableaux suivants, v\u00e9rifier qu&apos;il ne s&apos;agit pas de tableaux de donn\u00e9es :
SummaryPresentCheckDataTable=L&apos;attribute summary est pr\u00e9sent sur les tableaux suivants, v\u00e9rifier qu&apos;il s&apos;agit bien de tableaux de donn\u00e9es :
NotImmediateRedirectionViaMeta=La redirection initi\u00e9e par la balise meta n&apos;est pas imm\u00e9diate
ManualCheckOnElements=Veuillez v\u00e9rifier manuellement les \u00e9l\u00e9ments suivants :
RobotsTxtMissing=Le fichier robots.txt est absent ou vide.
SitemapMissing=Le fichier sitemap.xml est absent ou vide.
checkRelevancyTitleTag=Verifier la pertinence du contenu de la balise title suivant : 
notRelevantTitleTag=Le contenu de la balise title n'est pas pertinent : 
checkRelevancyMetaDescriptionTag=V\u00e9rifier la pertinence du contenu de la meta description :
MetaDescriptionTagLengthExceedLimit=Le contenu de la meta description d\u00e9passe les 255 caract\u00e8res.