Seo-0201=La page ne doit pas contenir de cadres (balise frame). Cette r&egrave;gle est-elle respect&eacute;e ?
Seo-0201-url=#
Seo-0202=La page ne doit pas contenir de cadres en ligne (balise iframe). Cette r&egrave;gle est-elle respect&eacute;e ?
Seo-0202-url=#
Seo-0401=La page ne doit pas contenir de contenu flash. Cette r&egrave;gle est-elle respect&eacute;e ?
Seo-0401-url=#
Seo-0501=Chaque page web poss&egrave;de-t-elle un tableau (balise table) ?
Seo-0501-url=#
Seo-0507=Chaque page web poss&egrave;de-t-elle une cellule de tableau li&eacute;e \u00e0 une ent&ecirc;te (balise td avec attribut headers non vide) ?
Seo-0507-url=#
Seo-01011=Chaque page contient-elle une meta description (balise "meta" avec un attribut "name" &eacute;gal \u00e0 "description" et un attribut "content") ?
Seo-01011-url=#
Seo-01012=Pour chaque page possedant une meta description (balise "meta" avec un attribut "name" &eacute;gal \u00e0 "description" et un attribut "content"), l&#39;attribut content est-il pertinent ?
Seo-01012-url=#
Seo-01013=Pour chaque page possedant une meta description (balise "meta" avec un attribut "name" &eacute;gal \u00e0 "description" et un attribut "content"), l&#39;attribut content comporte-t-il un maximum de 255 caract&egrave;res?
Seo-01013-url=#
Seo-01021=Pour chaque page d&#39;un site ou d&#39;un groupe de page, la meta description est-elle unique ?
Seo-01021-url=#
Seo-01031=L&#39;URL de chaque page comporte-t-elle un maximum de 255 caract&egrave;res ?
Seo-01031-url=#
Seo-01041=Pour chaque page d&#39;un site ou d&#39;un groupe de page, le code source est-il unique?
Seo-01041-url=#
Seo-01051=Le fichier robots.txt est-il pr&eacute;sent \u00e0 la racine du site?
Seo-01051-url=#
Seo-01061=Le fichier sitemap.xml est-il pr&eacute;sent \u00e0 la racine du site?
Seo-01061-url=#
Seo-02011=Chaque image (balise img) a-t-elle un attribut alt ?
Seo-02011-url=#
Seo-02012=Chaque zone (balise area) d&#39;une image r&eacute;active a-t-elle un attribut alt ?
Seo-02012-url=#
Seo-02013=Chaque bouton de formulaire (balise input avec l&#39;attribut type="image") a-t-il un attribut alt ?
Seo-02013-url=#
Seo-03011=Chaque page web est-elle d&eacute;pourvue de cadre (balises frameset) ?
Seo-03011-url=#
Seo-03012=Chaque cadre en ligne (balise iframe) a-t-il un attribut title ?
Seo-03012-url=#
Seo-05011=Chaque intitul&eacute; de lien texte est-il explicite ?
Seo-05011-url=#
Seo-05012=Chaque intitul&eacute; de lien image (contenu de l&#39;attribut alt ou contenu entre &lt;object&gt;&lt;/object&gt;) est-il explicite ?
Seo-05012-url=#
Seo-05013=Chaque intitul&eacute; de lien de type zone cliquable (contenu de l&#39;attribut alt d&#39;une balise area) est-il explicite ?
Seo-05013-url=#
Seo-06011=Chaque page Web a-t-elle un titre de page (balise title) ?
Seo-06011-url=#
Seo-06021=Pour chaque page Web ayant un titre de page (balise title), le contenu de cette balise est-il pertinent ?
Seo-06021-url=#
Seo-06031=Pour chaque page poss&eacute;dant une balise title, son contenu comporte-t-il un maximum de 70 caract&egrave;res ?
Seo-06031-url=#
Seo-06041=Pour chaque page d&#39;un site ou d&#39;un groupe de page, la balise title est-elle unique?
Seo-06041-url=#
Seo-06051=Pour chaque page Web, le type de document (balise doctype) est-il pr&eacute;sent ?
Seo-06051-url=#
Seo-06052=Pour chaque page Web, le type de document (balise doctype) est-il valide ?
Seo-06052-url=#
Seo-07011=Dans chaque page Web, un titre de niveau 1 (balise h1) est-il pr&eacute;sent?
Seo-07011-url=#
Seo-07012=Dans chaque page Web, la hi&eacute;rarchie entre les titres (balises h) est-elle pertinente ?
Seo-07012-url=#
Seo-07013=Dans chaque page Web poss&eacute;dant un titre de niveau 1(balise h1), son contenu comporte-t-il un maximum de 255 caract&egrave;res ?
Seo-07013-url=#
Seo-07021=Dans chaque page Web, un seul titre de niveau 1 (balise h1) est-il pr&eacute;sent?
Seo-07021-url=#
Seo-07051=Dans chaque page web, le titre de niveau 1 (balise h1) est-il diff&eacute;rent du titre de page (balise title) ? 
Seo-07051-url=#
Seo-07061=Pour chaque page d&#39;un site ou d&#39;un groupe de page, la balise h1 est-elle unique?
Seo-07061-url=#
Seo-08011=Pour chaque page web, les contenus sont restitu&eacute;s sans la technologie Flash? 
Seo-08011-url=#